<!DOCTYPE html>
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="" lang="">
<head>
<meta http-equiv="content-type" content="text/html; charset=UTF-8">
<meta charset="utf-8">
<meta name="generator" content="pandoc">
<meta name="viewport" content="width=device-width, initial-scale=1.0, user-scalable=yes">
<title>Partitionieren mit gdisk</title>
<style>
body            {font-family: Verdana, sans-serif; margin: 0 auto; float: left; max-width: 1000px; padding: 4%; border: #CCC thin solid; color: black;}
p               {line-height: 1.4;}
code            {display: block; background-color: #EEE; padding: 0.5em; border: #CCC thin solid; border-radius: 3px;}
p code, li code {display: inline; color: #000; padding: 0.15em; font-size: 1.2em;}
pre code        {display: block; color: #000; padding: 0.15em; font-size: 1.2em;}
table, th, td   {background-color: #EED; border: #CCC thin solid; border-collapse: collapse; padding: 0.15em;}
hr              {height: 0.2em; background-color: #CCC; border: 0; margin: 2em 0 2em 0;}
figcaption      {font-size: 0.8em; color: #888;}
warning         {display: block; line-height: 1.3em; padding: 0.4em; background: #FFDDDD; border: 0.15em solid #C33; border-radius: 0.5em;}
img             {border: 0.1em solid #CCC;}
a               {color: black; text-decoration: underline;}
a:visited       {color: #FF6600;}
a:hover         {color: #FFF; background-color: #FF6600; transition: all .25s ease-in;}
#rev            {float:right; font-size: 0.8em; color: #888;}
</style>
</head>
<body>
<header id="title-block-header">
<h1 class="title">Partitionieren mit gdisk</h1>
</header>
<nav id="TOC" role="doc-toc">
<ul>
<li><a href="#partitionieren-mit-gdisk">Partitionieren mit gdisk</a>
<ul>
<li><a href="#partitionierung-einer-festplatte">Partitionierung einer Festplatte</a></li>
<li><a href="#cgdisk-verwenden">cgdisk verwenden</a>
<ul>
<li><a href="#partition-erstellen">Partition erstellen</a></li>
<li><a href="#partition-l&ouml;schen">Partition l&ouml;schen</a></li>
<li><a href="#gpt-schreiben">GPT schreiben</a></li>
</ul></li>
<li><a href="#formatieren-der-partitionen">Formatieren der Partitionen</a></li>
<li><a href="#booten-mit-gpt-uefi-oder-gpt-bios">Booten mit GPT-UEFI oder GPT-BIOS</a>
<ul>
<li><a href="#booten-mit-uefi">Booten mit UEFI</a></li>
<li><a href="#booten-mit-bios">Booten mit BIOS</a></li>
</ul></li>
<li><a href="#erweiterte-befehle-von-gdisk">Erweiterte Befehle von gdisk</a></li>
</ul></li>
</ul>
</nav>
<h2 id="partitionieren-mit-gdisk">Partitionieren mit gdisk</h2>
<p><strong>Warum gdisk (GPT fdisk) verwenden?</strong></p>
<p><strong>gdisk</strong> leitet sich von <strong>G</strong>lobally Unique Identifier <strong>P</strong>artition <strong>T</strong>able (GPT) ab und ist eine Anwendung, um Datentr&auml;ger von jeder Gr&ouml;&szlig;e zu partitionieren. gdisk wird unbedingt ben&ouml;tigt f&uuml;r Datentr&auml;ger, die gr&ouml;&szlig;er als 2TB sind.<br />
gdisk sorgt daf&uuml;r, dass Partitionen f&uuml;r SSDs eingerichtet sind (bzw. f&uuml;r Speicher, die keine 512 Byte gro&szlig;en Sektoren besitzen).</p>
<p>Ein entscheidender Vorteil von GPT ist, dass man nicht mehr auf die dem MBR inh&auml;renten prim&auml;ren, erweiterten oder logischen Partitionen angewiesen ist. GPT kann eine beinahe unbegrenzte Anzahl von Partitionen unterst&uuml;tzen und ist nur durch den f&uuml;r Partitionseintr&auml;ge reservierten Speicherplatz des GPT-Datentr&auml;gers eingeschr&auml;nkt. Zu beachten ist, dass die Anwendung gdisk standardm&auml;&szlig;ig f&uuml;r 128 Partitionen eingestellt ist.</p>
<p>Falls GPT auf kleinen USB/SSD-Datentr&auml;gern eingesetzt wird (zum Beispiel auf einem USB-Stick mit 8GB), k&ouml;nnte sich dies kontraproduktiv auswirken, wenn Daten zwischen verschiedenen Computern oder Betriebssystemen ausgetauscht werden sollen.<br />
F&uuml;r diesen Zweck, und sofern &auml;ltere Hardware zum Einsatz kommt, verwenden wir besser <code>fdisk</code>, das Partitionstabellen auf Basis des MBR erstellt. Siehe die Handbuchseite <a href="https://manual.siduction.org/part-cfdisk_de.html#partitionieren-mit-fdisk">Partitionieren mit Cfdisk</a>.</p>
<p><strong>Wichtige Anmerkungen</strong></p>
<ul>
<li><p>Die Begriffe UEFI und EFI sind austauschbar und bezeichnen das gleiche Konzept - <strong>U</strong>nified <strong>E</strong>xtensible <strong>F</strong>irmware <strong>I</strong>nterface (englisch f&uuml;r Vereinheitlichte erweiterbare Firmware-Schnittstelle).<br />
Siehe <a href="https://de.wikipedia.org/wiki/Unified_Extensible_Firmware_Interface">Wikipedia UEFI</a>.<br />
Die GPT ist ein Teil des UEFI Standards.</p></li>
<li><p>GPT-Datentr&auml;ger verwenden</p>
<ul>
<li><p>GPT-Datentr&auml;ger k&ouml;nnen unter Linux auf Computern mit 32 bit und 64 bit eingesetzt werden.</p></li>
<li><p>Einige Betriebssysteme unterst&uuml;tzen keine GPT-Datentr&auml;ger.<br />
Dazu z&auml;hlen alle MS Betriebssysteme vor Windows Vista SP1.<br />
Ziehe bitte die Dokumentation des jeweiligen Systems zu Rate.</p></li>
</ul></li>
<li><p>Booten von GPT-Datentr&auml;gern</p>
<ul>
<li><p>Dual- und Triple-Boot von GPT-Datentr&auml;gern mit Linux, BSD und Apple ist mit dem EFI-Modus mit 64 bit unterst&uuml;tzt.</p></li>
<li><p>Dual-Boot von GPT-Datentr&auml;gern mit Linux und MS Windows ist ab Windows Vista SP1 m&ouml;glich. Voraussetzung ist dabei f&uuml;r Windows die 64 bit Version.</p></li>
</ul></li>
<li><p>Graphische Partitionierungsprogramme f&uuml;r GPT<br />
Neben dem Befehlszeilenprogramm <code>gdisk</code> unterst&uuml;tzen graphische Anwendungen wie <code>gparted</code> und <code>partitionmanager</code> GPT-Datentr&auml;ger. Trotzdem empfehlen wir gdisk, um unerw&uuml;nschten Anomalien vorzubeugen. Gparted sowie KDEs Partition Manager (und andere) sind dennoch gro&szlig;artige Hilfsmittel besonders um die Partitionierung zu visualisieren.</p></li>
</ul>
<p><strong>Grundlegende Lekt&uuml;re:</strong></p>
<ul>
<li>man gdisk</li>
<li><a href="http://www.rodsbooks.com/gdisk/">GPT fdisk Tutorial by Roderick W. Smith (Englisch)</a></li>
<li><a href="https://de.wikipedia.org/wiki/Unified_Extensible_Firmware_Interface#Betriebssysteme">Wikipedia UEFI-Unterst&uuml;tzung der Betriebssysteme</a></li>
<li><a href="https://de.wikipedia.org/wiki/GUID_Partition_Table">Wikipedia GUID-Partitionstabelle (Deutsch)</a></li>
</ul>
<h3 id="partitionierung-einer-festplatte">Partitionierung einer Festplatte</h3>
<warning>
<strong>Daten zuvor sichern!</strong> <br />Bei Verwendung jedweder Partitionierungssoftware droht Datenverlust. Daten, die erhalten bleiben sollen, immer zuvor auf einem anderen Datentr&auml;ger sichern.
</warning>
<p>In dem folgenden Beispiel werden wir eine 150GB Festplatte so formatieren, dass anschlie&szlig;end zwei Linux Systeme als Dualboot installierbar sein werden. Damit die Vorteile des UEFI zum tragen kommen, ben&ouml;tigen wir in der GPT eine <em>“EFI-System”</em>-Partition und f&uuml;r die zweite Stufe des GRUB-Bootloader eine <em>“BIOS-boot”</em>-Partition.<br />
Wir zeigen die notwendigen Arbeitsschritte mit dem Partitionierungsprogramm <code>cgdisk</code>, das GPT mit UEFI unterst&uuml;tzt.</p>
<p>cgdisk ist die Curses-basierte Programmvariante von gdisk. Sie bietet eine benutzerfreundliche Bedienoberfl&auml;che innerhalb des Terminals.<br />
Die Navigation erfolgt mittels der Pfeiltasten.</p>
<ul>
<li>F&uuml;r die Partitionen <strong><code>auf</code></strong> und <strong><code>ab</code></strong></li>
<li>F&uuml;r die Aktionsauswahl <strong><code>rechts</code></strong> und <strong><code>links</code></strong>.</li>
<li>Mit <strong><code>Enter</code></strong> wird die Auswahl bzw. Eingabe best&auml;tigt.</li>
</ul>
<h3 id="cgdisk-verwenden">cgdisk verwenden</h3>
<p>Der Startbefehl in einem root-Terminal lautet: <strong><code>cgdisk /dev/sdX</code></strong>.</p>
<p>cgdisk startet mit einer Warnmeldung, wenn keine GPT gefunden wird.</p>
<p><img src="./images/cgdisk/cgdisk_00.png" /></p>
<p>Wir ben&ouml;tigen f&uuml;r die beiden Betriebssysteme insgesamt sechs Partitionen: Zwei ROOT-, eine gemeinsame DATEN- sowie eine SWAP-Partition f&uuml;r den Auslagerungsspeicher. Zus&auml;tzlich die bereits oben erw&auml;hnte <em>“EFI-System”</em>-Partition (maximal 100MB) und die <em>“BIOS-boot”</em>-Partition (1MB).<br />
Wir empfehlen, das <code>/home</code>-Verzeichnis auf der ROOT-Partition zu belassen. Das Verzeichnis <code>/home</code> sollte der Ort sein, an dem die individuellen Konfigurationen abgelegt werden, und nur diese. F&uuml;r alle weiteren privaten Daten sollte eine eigene Datenpartition angelegt werden. Die Vorteile f&uuml;r die Datenstabilit&auml;t, Datensicherung und auch im Falle einer Datenrettung sind nahezu unermesslich.</p>
<p>Das Startbild</p>
<p><img src="./images/cgdisk/cgdisk_01.png" /></p>
<h4 id="partition-erstellen">Partition erstellen</h4>
<p>Wir w&auml;hlen <strong><code>New</code></strong> und best&auml;tigen mit <strong><code>Enter</code></strong>. Mit einem zweiten <strong><code>Enter</code></strong> &uuml;bernehmen wir den voreingestellten ersten Sektor f&uuml;r die neue Partition. Dann geben wir die gew&uuml;nschte Gr&ouml;&szlig;e von <code>100M</code> f&uuml;r die <em>“EFI-System”</em>-Partition ein und best&auml;tigen die Eingabe.</p>
<p><img src="./images/cgdisk/cgdisk_02.png" /></p>
<p>Nun wird von uns die Eingabe des Type-Code f&uuml;r die Partition erwartet.</p>
<p><img src="./images/cgdisk/cgdisk_03.png" /></p>
<p>Nach Eingabe von <strong><code>L</code></strong> erscheint eine lange Liste mit den Codes und ihrer Verwendung. Die integrierte Suchfunktion vereinfacht die Auswahl. F&uuml;r uns sind folgende Codes notwendig:<br />
ef00 f&uuml;r EFI-System<br />
ef02 f&uuml;r BIOS-boot<br />
8200 f&uuml;r Swap<br />
8304 f&uuml;r Linux Root<br />
8300 f&uuml;r Linux Daten</p>
<p>Wir tragen also <code>ef00</code> ein und best&auml;tigen. Anschlie&szlig;end d&uuml;rfen wir optional noch einen Namen (Label) vergeben, was im Beispiel getan wurde, und die Eingabe wieder best&auml;tigen. Mit den Partitionen f&uuml;r BIOS-boot, Linux-root und Swap wird nach gleichem Muster verfahren. Das n&auml;chst Bild zeigt das Ergebnis unserer Bem&uuml;hungen. Wie wir sehen ist noch reichlich Platz f&uuml;r ein zweites System und vor allem f&uuml;r eine gemeinsam genutzte Daten-Partition vorhanden.</p>
<p><img src="./images/cgdisk/cgdisk_04.png" /></p>
<p>Nachdem die zwei Partitionen erstellt wurden, sehen wir die Aufteilung der gesamten Festplatte im n&auml;chste Bild.</p>
<p><img src="./images/cgdisk/cgdisk_05.png" /></p>
<p>Die Partitionen, die die beiden Systeme sp&auml;ter im Betrieb verwenden, sind farblich gekennzeichnet.<br />
An Anfang und Ende befinden sich noch kleine, freie Bereiche. Sie entstehen durch die Ausrichtung der Partition an die Blockgrenzen der Festplatte und k&ouml;nnen auch zwischen den Partitionen auftauchen. Mit <strong><code>Align</code></strong> kann der Wert f&uuml;r die Anzahl der Sektoren ge&auml;ndert werden. F&uuml;r SSD und M2-Disk sind es in der Regel 2048 Sektoren und f&uuml;r alte Festplatten 512 Sektoren. gdisk liest die Metadaten der Festplatten aus und stellt den Wert f&uuml;r die Sektoren danach ein. Deshalb ist in der Regel keine &Auml;nderung notwendig.</p>
<p>Zus&auml;tzliche, detailierte Informationen zu den Partitionen lassen sich einsehen, wenn der Befehl <strong><code>Info</code></strong> benutzt wird.</p>
<p><img src="./images/cgdisk/cgdisk_06.png" /></p>
<p>Mit <strong><code>Verify</code></strong> wird die Partitionierung &uuml;berpr&uuml;ft und eventuelle Fehler werden angezeigt.</p>
<p><img src="./images/cgdisk/cgdisk_07.png" /></p>
<p>Hier ist alles in Ordnung.<br />
Sollten Fehler gemeldet werden, markieren wir die Partition und benutzen den Befehl <strong><code>Info</code></strong>, und entscheiden ob die Partition gel&ouml;scht und neu angelegt werden muss und ob dabei z. B. die Gr&ouml;&szlig;e zu &auml;ndern ist. Wenn mit diesen Mitteln eine Reparatur nicht m&ouml;glich ist, stehen routinierten Usern die <a href="https://manual.siduction.org/part-gdisk_de.html#erweiterte-befehle-von-gdisk">Erweiterten Befehle von gdisk</a> zur Verf&uuml;gung.</p>
<h4 id="partition-l&ouml;schen">Partition l&ouml;schen</h4>
<p>Um eine Partition zu l&ouml;schen, markieren wir diese und benutzen den Befehl <strong><code>Delete</code></strong>.</p>
<p><img src="./images/cgdisk/cgdisk_08.png" /></p>
<p>Bei Notwendigkeit verfahren wir mit anderen Partitionen genauso und k&ouml;nnen dann mit ge&auml;nderten Werten die Partitionen wieder erstellen.</p>
<h4 id="gpt-schreiben">GPT schreiben</h4>
<p>Entspricht die Partitionierung der Festplatte unseren Vorstellungen pr&uuml;fen wir noch einmal mit dem Befehl <strong><code>Verify</code></strong> ob alles in Ordnung ist. Werden keine Fehler angezeigt, w&auml;hlen wir <strong><code>Write</code></strong> und</p>
<p><img src="./images/cgdisk/cgdisk_09.png" /></p>
<p>d&uuml;rfen die Sicherheitsabfrage mit <strong><code>yes</code></strong> beantworten.</p>
<p><img src="./images/cgdisk/cgdisk_10.png" /></p>
<p>Der Warnhinweis sollte ernst genommen werden, denn nach Bet&auml;tigung der <strong><code>Enter</code></strong>-Taste verschwinden alle Daten, die zuvor auf der Festplatte waren im Nirwana.</p>
<p>Da cgdisk nur Partitionen, aber keine Dateisysteme erstellt, muss jede der neuen Partitionen formatiert werden. Mit <strong><code>Quit</code></strong> wird cgdisk beendet.</p>
<h3 id="formatieren-der-partitionen">Formatieren der Partitionen</h3>
<p>Wir bleiben im Root-Terminal und lassen uns die Pfade mit den Nummern f&uuml;r jede Partition anzeigen:</p>
<pre><code>fdisk -l | grep /dev/sdb</code></pre>
<p>Der Befehl generiert die folgende Ausgabe:</p>
<pre><code>Disk /dev/sdb: 149,5 GiB, 160041885696 bytes, 312581808 sectors
/dev/sdb1      2048    206847    204800 100M EFI System
/dev/sdb2    206848    208895      2048   1M BIOS boot
/dev/sdb3    208896  52637695  52428800  25G Linux root
/dev/sdb4  52637696  61026303   8388608   4G Linux swap
/dev/sdb5  61026304 260255743 199229440  95G Linux filesyst
/dev/sdb6 260255744 312581808  52326064  25G Linux root</code></pre>
<p>Mit diesen Informationen formatieren wir unsere zuvor erstellten Partitionen.</p>
<p>Bitte die Manpages <strong><code>man mke2fs</code></strong>, <strong><code>man mkfs.fat</code></strong> und <strong><code>man mkswap</code></strong> lesen.</p>
<p>Die EFI-Systempartition erh&auml;lt ein <strong>FAT32</strong> Dateisystem.</p>
<pre><code>mkfs.vfat /dev/sdb1</code></pre>
<p><strong>Die BIOS_Boot-Partition darf nicht formatiert werden!</strong><br />
Sofern der Bootmanager <code>GRUB</code> bei der Installation die <em>“EFI-System”</em>- und die <em>“BIOS_Boot”</em>-Partition findet, benutzt er sie, gleichg&uuml;ltig, welches Installationsziel wir angegeben haben.</p>
<p>Die Linuxpartitionen <code>sdb3</code>, <code>sdb5</code> und <code>sdb6</code> formatieren wir mit <strong>ext4</strong>.</p>
<pre><code>mkfs.ext4 /dev/sdb3</code></pre>
<p>Die Swap-Partition wird mit:</p>
<pre><code>mkswap /dev/sdb4</code></pre>
<p>eingerichtet. Danach machen wir sie mit:</p>
<pre><code>swapon /dev/sdb4</code></pre>
<p>dem System bekannt und kontrollieren, ob der Swap-Speicher verf&uuml;gbar ist:</p>
<pre><code>swapon -s
Filename   Type       Size     Used  Priority
/dev/sdb4  partition  4194304  0     -2</code></pre>
<p>Falls Swap korrekt erkannt wurde:</p>
<pre><code>swapoff /dev/sdb4</code></pre>
<p><strong>Als n&auml;chstes ist es unbedingt notwendig, das System neu zu starten, damit das neue Partitionierungs- und Dateisystemschema vom Kernel eingelesen wird.</strong></p>
<h3 id="booten-mit-gpt-uefi-oder-gpt-bios">Booten mit GPT-UEFI oder GPT-BIOS</h3>
<p>Falls ein bootbarer Datentr&auml;ger mit GPT erstellt werden soll, gibt es zwei M&ouml;glichkeiten den Bootsektor eines GPT-Datentr&auml;gers zu erstellen.</p>
<p>Diese M&ouml;glichkeiten sind:</p>
<ul>
<li>Der Computer (das Mainboard) besitzt ein UEFI</li>
<li>UEFI soll zum Booten des GPT-Datentr&auml;gers verwendet werden.</li>
</ul>
<p><strong>oder</strong></p>
<ul>
<li>Der Computer (das Mainboard) hat <strong>kein</strong> UEFI sondern ein BIOS. (Alle Mainboard vor 2009 haben kein UEFI)</li>
<li>Das BIOS soll zum Booten des GPT-Datentr&auml;gers verwendet werden.</li>
</ul>
<h4 id="booten-mit-uefi">Booten mit UEFI</h4>
<p>Wenn UEFI zum Booten verwendet werden soll, muss eine mit FAT formatierte <em>“EFI System”</em>-Partition (Typ “EF00” ) als erste Partition, und eine unformatierte <em>“BIOS boot”</em>-Partition (Typ “EF02” ) als zweite erstellt werden. Die erste Partition enth&auml;lt den/die Bootloader.<br />
W&auml;hrend der Installation von siduction wird jegliche Auswahlm&ouml;glichkeit der install-gui, wohin der Bootloader installiert werden soll, ignoriert, sofern die vorgenannten Partitionen existieren. Der Bootloader von siduction wird in der <em>“EFI-System”</em>-Partition unter <code>/efi/siduction</code> gespeichert. Die EFI-Systempartition wird auch als <code>/boot/efi</code> eingebunden, solange die Option der Einbindung weiterer Partitionen (“mount other partitions”) gew&auml;hlt ist. Die Einbindung der <em>“EFI-System”</em>-Partition muss im Installer nicht extra angegeben werden.</p>
<h4 id="booten-mit-bios">Booten mit BIOS</h4>
<p>Falls das System kein UEFI besitzt, muss als erste eine <strong>BIOS-Boot</strong>-Partition erstellt werden. Diese ersetzt den Sektor eines MBR-partitionierten Datentr&auml;gers, der sich zwischen der Partitionierungstabelle und der ersten Partition befindet, und in diesen wird Grub direkt geschrieben.<br />
Die Partition sollte die Gr&ouml;&szlig;e von 200MB haben. (Der Grund dieser Gr&ouml;&szlig;e anstelle der konventionellen 32MB liegt darin, um f&uuml;r den Fall eines Wechsels zu UEFI eine ausreichend gro&szlig;e Partition zur Verf&uuml;gung zu haben.)</p>
<h3 id="erweiterte-befehle-von-gdisk">Erweiterte Befehle von gdisk</h3>
<p>gdisk besitzt erweiterte Optionen und Sicherheitsmechanismen die in cgdisk nicht zur Verf&uuml;gung stehen.</p>
<p>Falls Probleme entdeckt wurden (z. B. &uuml;berlappende Partitionen oder nicht entsprechende Haupt- und Sicherungspartitionstabellen), besteht die M&ouml;glichkeit, diese mit verschiedenen Optionen im Men&uuml; <code>recovery &amp; transformation</code> zu beheben. Wir starten gdisk mit</p>
<pre><code>gdisk  /dev/sdb</code></pre>
<p>An der Eingabeaufforderung <strong><code>Command (? for help):</code></strong> geben wir den Befehl <strong><code>r</code></strong> ein, um in das Untermen&uuml; von <em>“recovery &amp; transformation”</em> zu gelangen und anschlie&szlig;end das <strong><code>?</code></strong>.</p>
<pre><code>recovery/transformation command (? for help): ?
b use backup GPT header (rebuilding main)
c load backup partition table from disk (rebuilding main)
d use main GPT header (rebuilding backup)
e load main partition table from disk (rebuilding backup)
f load MBR and build fresh GPT from it
g convert GPT into MBR and exit
h make hybrid MBR
i show detailed information on a partition
l load partition data from a backup file
m return to main menu
o print protective MBR data
p print the partition table
q quit without saving changes
t transform BSD disklabel partition
v verify disk
w write table to disk and exit
x extra functionality (experts only)
? print this menu</code></pre>
<p>Ein drittes Men&uuml;, <strong><code>experts</code></strong> , erreicht man mit <strong><code>x</code></strong> entweder vom <em>“main menu”</em> oder dem <em>“recovery &amp; transformation menu”</em>.</p>
<pre><code>recovery/transformation command (? for help): x

Expert command (? for help): ?
a set attributes
c change partition GUID
d display the sector alignment value
e relocate backup data structures to the end of the disk
g change disk GUID
i show detailed information on a partition
l set the sector alignment value
m return to main menu
n create a new protective MBR
o print protective MBR data
p print the partition table
q quit without saving changes
r recovery and transformation options (experts only)
s resize partition table
v verify disk
w write table to disk and exit
z zap (destroy) GPT data structures and exit
? print this menu</code></pre>
<p>Dieses Men&uuml; erm&ouml;glicht Low-Level-Bearbeitung wie &Auml;nderung der Partitions GUID oder der GUIDs des Datentr&auml;gers (<strong><code>c</code></strong> bzw. <strong><code>g</code></strong> ). Die Option <strong><code>z</code></strong> zerst&ouml;rt augenblicklich die GPT-Datenstrukturen. Dies kann sinnvoll sein, wenn der GPT-Datentr&auml;ger mit einem anderen Partitionierungsschema verwendet werden soll. Falls diese Strukturen nicht ausgel&ouml;scht werden, k&ouml;nnen einige Partitionierungsprogramme wegen des Vorhandenseins von zwei Partitionierungssystemen Probleme haben.</p>
<p>Trotz alledem: die Optionen der Men&uuml;s <em>“recovery &amp; transformation”</em> und <em>“experts”</em> sollten nur benutzt werden, wenn man sich sehr gut mit GPT auskennt. Als “Nicht-Experte” sollte man diese Men&uuml;s nur verwenden, wenn ein Datentr&auml;ger besch&auml;digt ist. Vor jeder drastischen Aktion sollte die Option <strong><code>b</code></strong> im Hauptmen&uuml; verwendet werden, um eine Sicherungskopie in einer Datei anzulegen und diese auf einem separaten Datentr&auml;ger speichern. Dadurch kann die originale Konfiguration wieder hergestellt werden, falls die Aktion nicht nach Wunsch l&auml;uft.</p>
<div id="rev">
Zuletzt bearbeitet: 2021-11-28
</div>
</body>
</html>
