<!DOCTYPE html>
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="" lang="">
<head>
<meta http-equiv="content-type" content="text/html; charset=UTF-8">
<meta charset="utf-8">
<meta name="generator" content="pandoc">
<meta name="viewport" content="width=device-width, initial-scale=1.0, user-scalable=yes">
<title>Partitionierung von “Logical Volume”</title>
<style>
body            {font-family: Verdana, sans-serif; margin: 0 auto; float: left; max-width: 1000px; padding: 4%; border: #CCC thin solid; color: black;}
p               {line-height: 1.3;}
code            {display: block; background-color: #EEE; padding: 0.5em; border: #CCC thin solid; border-radius: 3px;}
p code, li code {display: inline; color: #800; padding: 0.15em;}
li pre code     {display: block; color: #000; padding: 0.15em;}
table, th, td   {background-color: #EEC; border: #CCC thin solid; border-collapse: collapse; padding: 0.15em;}
hr              {height: 0.2em; background-color: #CCC; border: 0; margin: 2em 0 2em 0;}
figcaption      {font-size: 0.8em; color: #888;}
warning         {display: block; line-height: 1.3em; padding: 0.4em; background: #FFDDDD; border: 0.15em solid #C33; border-radius: 0.5em;}
img             {border: 0.1em solid #CCC;}
a               {color: black; text-decoration: underline;}
a:visited       {color: #FF6600;}
a:hover         {color: #FFF; background-color: #FF6600; transition: all .25s ease-in;}
#rev            {float:right; font-size: 0.8em; color: #888;}
</style>
</head>
<body>
<header id="title-block-header">
<h1 class="title">Partitionierung von “Logical Volume”</h1>
</header>
<nav id="TOC" role="doc-toc">
<ul>
<li><a href="#lvm-partitionierung---logical-volume-manager">LVM-Partitionierung - Logical Volume Manager</a>
<ul>
<li><a href="#sechs-schritte-zu-logical-volumes">Sechs Schritte zu Logical Volumes</a></li>
<li><a href="#gr&ouml;&szlig;en&auml;nderung-eines-volumens">Gr&ouml;&szlig;en&auml;nderung eines Volumens</a></li>
<li><a href="#lvm-mit-einem-gui-programm-verwalten">LVM mit einem GUI-Programm verwalten</a></li>
<li><a href="#weitere-infos">Weitere Infos</a></li>
</ul></li>
</ul>
</nav>
<h2 id="lvm-partitionierung---logical-volume-manager">LVM-Partitionierung - Logical Volume Manager</h2>
<p><strong>Es folgt nun eine Basiseinf&uuml;hrung. Es liegt am gesch&auml;tzten Leser, sich tiefer in die Materie einzuarbeiten. Weitere Informationsquellen finden sich am Ende dieses Textes - die Liste erhebt keinen Anspruch auf Vollst&auml;ndigkeit.</strong></p>
<p>Das Arbeiten mit <em>Logical Volumes</em> ist viel einfacher als die meisten User glauben. Die beste Eigenschaft von LVM ist, dass &Auml;nderungen wirksam werden ohne daf&uuml;r das System neu starten zu m&uuml;ssen. <em>Logical Volumes</em> k&ouml;nnen mehrere Festplatten umspannen und sind skalierbar. Dies unterscheidet sie von anderen Methoden der Festplattenpartitionierung.</p>
<p>Mit drei Grundbegriffen sollte man vertraut sein:</p>
<ul>
<li><p><strong>Physisches Volumen (Physical Volume):</strong> Diese sind die physischen, real vorhandenen, Festplatten oder Partitionen wie zum Beispiel /dev/sda oder /dev/sdb1 und werden zum Einbinden/Aush&auml;ngen verwendet. Mit LVM k&ouml;nnen mehrere physische Volumen in Volumengruppen zusammengefasst werden.</p></li>
<li><p><strong>Volumengruppe (Volume Group):</strong> Eine Volumengruppe besteht aus <em>Physischen Volumen</em> und ist der Speicherort von <em>Logischen Volumen</em>. Eine Volumengruppe kann als “virtuelles Laufwerk” gesehen werden, das aus <em>Physischen Volumen</em> zusammengesetzt ist. Zum Verst&auml;ndnis einige Beispiele:</p>
<ul>
<li><p>Mehrere Speicherger&auml;te (z. B. Festplatten, SSDs, M2-Disks, externe USB-Festplatten usw.) k&ouml;nnen zu einer Volumengruppe (einem virtuellen Laufwerk) zusammengefasst werden.</p></li>
<li><p>Mehrere Partitionen eines Speicherger&auml;tes k&ouml;nnen zu einer Volumengruppe (einem virtuellen Laufwerk) zusammengefasst werden.</p></li>
<li><p>Eine Kombination aus den beiden vorgenannten M&ouml;glichkeiten. Z. B. drei SSDs, wovon von der ersten nur zwei Partitionen und die beiden anderen vollst&auml;ndig in der Volumengruppe zusammengefasst werden.</p></li>
</ul></li>
<li><p><strong>Logisches Volumen (Logical Volume):</strong> Logische Volumen werden inerhalb einer <em>Volumengruppe</em> erstellt und in das System eingebunden. Man kann sie auch als “virtuelle” Partitionen verstehen. Sie sind dynamisch ver&auml;nderbar, k&ouml;nnen in der Gr&ouml;&szlig;e ver&auml;ndert, neu erstellt, entfernt und verwendet werden. Ein logisches Volumen kann sich innerhalb der Volumengruppe &uuml;ber mehrere physische Volumen erstrecken.</p></li>
</ul>
<h3 id="sechs-schritte-zu-logical-volumes">Sechs Schritte zu Logical Volumes</h3>
<warning>
<strong>Achtung</strong> <br />Wir gehen in unserem Beispiel von nicht partitionierten Festplatten aus. Zu beachten ist: Falls alte Partitionen gel&ouml;scht werden, gehen alle Daten unwiederbringlich verloren.
</warning>
<p>Als Partitionierungsprogramm werden cfdisk oder gdisk ben&ouml;tigt, da zur Zeit GParted bzw. der KDE-Partitionsmanager (partitionmanager) das Anlegen von <em>Logical Volumes</em> nicht unterst&uuml;tzen. Siehe auch die Handbuchseiten:<br />
<a href="https://manual.siduction.org/part-cfdisk_de.html#partitionieren-mit-fdisk">Partitionieren mit cfdisk (msdos-MBR)</a><br />
<a href="https://manual.siduction.org/part-gdisk_de.html#partitionieren-mit-gdisk">Partitionieren mit gdisk (GPT-UEFI)</a></p>
<p>Alle folgenden Befehle und Aktionen erfordern root-Rechte.</p>
<ol type="1">
<li><p>Erstellung einer Partitionstabelle</p>
<pre><code>cfdisk /dev/sda
n    -&gt; erstellt eine neue Partition auf dem Laufwerk
p    -&gt; diese Partition wird eine prim&auml;re Partition
1    -&gt; die Partition erh&auml;lt die Nummer 1 als Identifikation
### size allocation  ### setzt den ersten und letzten Zylinder auf Default-Werte. Dr&uuml;cke ENTER, um das gesamte Laufwerk zu umspannen
t    -&gt; w&auml;hlt den zu erstellenden Partitionstyp
8e   -&gt; der Hex-Code f&uuml;r eine Linux-LVM
W    -&gt; schreibt Ver&auml;nderungen auf das Laufwerk.</code></pre>
<p>Der Befehl “W” schreibt die Partitionierungstabelle. Falls bis zu diesem Punkt ein Fehler gemacht wurde, kann das vorhandene Partitionierungs-Layout wieder hergestellt werden. Zu diesen Zweck gibt man den Befehl “q” ein, <em>cfdisk</em> beendet sich ohne Schreibvorgang, und alles bleibt wie es zuvor war.</p>
<p>Falls die Volumengruppe mehr als ein Physische Volumen (Laufwerk) umspannen soll, muss obiger Vorgang auf jedem physischen Volumen durchgef&uuml;hrt werden.</p></li>
<li><p>Erstellen eines physischen Volumens</p>
<pre><code>pvcreate /dev/sda1</code></pre>
<p>Der Befehl erstellt auf der ersten Partition der ersten Festplatte das physische Volumen.<br />
Dieser Vorgang wird nach Bedarf auf jeder Partition wiederholt.</p></li>
<li><p>Erstellen einer Volumengruppe</p>
<p>Nun f&uuml;gen wir die physischen Volumen einer Volumengruppe mit dem Namen <em>vulcan</em> hinzu (in unserem Beispiel drei Laufwerke):</p>
<pre><code>vgcreate vulcan /dev/sda1 /dev/sdb1 /dev/sdc1</code></pre>
<p>Falls dieser Schritt korrekt durchgef&uuml;hrt wurde, kann das Ergebnis in der Ausgabe folgenden Befehls gesehen werden:</p>
<pre><code>vgscan</code></pre>
<p>vgdisplay zeigt die Gr&ouml;&szlig;e mit:</p>
<pre><code>vgdisplay vulcan</code></pre></li>
<li><p>Erstellung eines logischen Volumens</p>
<p>An dieser Stelle muss entschieden werden, wie gro&szlig; das logische Volumen zu Beginn sein soll. Ein Vorteil von LVM ist die M&ouml;glichkeit, die Gr&ouml;&szlig;e ohne Reboot anpassen zu k&ouml;nnen.</p>
<p>In unserem Beispiel w&uuml;nschen wir uns ein 300GB gro&szlig;es Volumen mit dem Namen <em>spock</em> innerhalb der Volumengruppe Namens vulcan:</p>
<pre><code>lvcreate -n spock --size 300g vulcan</code></pre></li>
<li><p>Formatieren des logischen Volumens</p>
<p>Bitte habe etwas Geduld, dieser Vorgang kann l&auml;ngere Zeit in Anspruch nehmen.</p>
<pre><code>mkfs.ext4 /dev/vulcan/spock</code></pre></li>
<li><p>Einbindung des logischen Volumens</p>
<p>Erstellen des Mountpoints mit</p>
<pre><code>mkdir /media/spock/</code></pre>
<p>Um das Volumen w&auml;hrend des Bootvorgangs einzubinden, muss fstab mit einem Texteditor angepasst werden.<br />
Die Verwendung von <strong>/dev/vulcan/spock</strong> ist bei einem LVM der Verwendung von UUID-Nummern vorzuziehen, da es damit einfacher ist das Dateisystem zu klonen (keine UUID-Kollisionen). Besonders mit einem LVM k&ouml;nnen Dateisysteme mit gleicher UUID-Nummer erstellt werden (Musterbeispiel: Snapshots).</p>
<pre><code>mcedit /etc/fstab</code></pre>
<p>und dann die folgende Zeile entsprechend unseres Beispiels einf&uuml;gen.</p>
<pre><code>/dev/vulcan/spock /media/spock/ ext4 auto,users,rw,exec,dev,relatime 0 2</code></pre>
<p>Optional:<br />
Der Besitzer des Volumens kann ge&auml;ndert werden, sodass andere Nutzer Lese- bzw. Schreibzugang zum Logical Volumen haben:</p>
<pre><code>chown root:users /media/spock
chmod 775 /media/spock</code></pre></li>
</ol>
<p>Die Schritte 4 bis 6 k&ouml;nnen wir nun f&uuml;r das neu zu erstellende logische Volumen “kirk” wiederholen.</p>
<p>Ein einfacher LVM sollte nun erstellt sein.</p>
<h3 id="gr&ouml;&szlig;en&auml;nderung-eines-volumens">Gr&ouml;&szlig;en&auml;nderung eines Volumens</h3>
<p>Wir empfehlen die Verwendung einer Live-ISO, um Partitionsgr&ouml;&szlig;en zu &auml;ndern. Obwohl die Vergr&ouml;&szlig;erung einer Partition des laufenden Systems ohne Fehler durchgef&uuml;hrt werden kann, ist dies bei der Verkleinerung einer Partition nicht der Fall. Anomalien k&ouml;nnen zu einem Datenverlust f&uuml;hren, vor allem wenn die Verzeichnisse <strong>/</strong> (root) oder <strong>/home</strong> betroffen sind.</p>
<p><strong>Beispiel einer Vergr&ouml;&szlig;erung</strong></p>
<p>Eine Partition soll von 300GB auf 500GB vergr&ouml;&szlig;ert werden:</p>
<pre><code>umount /media/spock/</code></pre>
<p>Erweitern des logischen Volumens:</p>
<pre><code>lvextend -L+200g /dev/vulcan/spock</code></pre>
<p>Dem Befehl <em>lvextend</em> ist als Option der Wert f&uuml;r die Gr&ouml;&szlig;en<strong>&auml;nderung</strong> anzugeben und nicht die gew&uuml;nscht Gesamtgr&ouml;&szlig;e.</p>
<p>Anschlie&szlig;end die Gr&ouml;&szlig;e des Dateisystems &auml;ndern:<br />
Der erste Befehl f&uuml;hrt zwangsweise eine Check durch, auch wenn das Dateisystem sauber zu sein scheint,<br />
der letzte Befehl h&auml;ngt das logische Volumen wieder ein.</p>
<pre><code>e2fsck -f /dev/vulcan/spock
resize2fs /dev/vulcan/spock
mount /media/spock</code></pre>
<p><strong>Beispiel einer Verkleinerung</strong></p>
<p>Eine Partition wird von 500GB auf 280GB verkleinert:</p>
<pre><code>umount /media/spock/</code></pre>
<p>Die Gr&ouml;&szlig;e des Dateisystems verringern:</p>
<pre><code>e2fsck -f /dev/vulcan/spock
resize2fs /dev/vulcan/spock 280g</code></pre>
<p>Danach wird das logische Volumen ge&auml;ndert.</p>
<pre><code>lvreduce -L-220g /dev/vulcan/spock
resize2fs /dev/vulcan/spock
mount /media/spock</code></pre>
<p>Auch hier ist dem Befehl <em>lvreduce</em> als Option der Wert f&uuml;r die Gr&ouml;&szlig;en<strong>&auml;nderung</strong> anzugeben.<br />
Der erneute <em>resize2sf</em>-Befehl passt das Dateisystem exakt an die Gr&ouml;&szlig;e des logischen Volumens an.</p>
<h3 id="lvm-mit-einem-gui-programm-verwalten">LVM mit einem GUI-Programm verwalten</h3>
<p><em>Gparted</em> bietet die M&ouml;glichkeit zur Verwaltung von bereits angelegten <em>Logical Volumes</em>. Das Programm wird als root ausgef&uuml;hrt.</p>
<h3 id="weitere-infos">Weitere Infos</h3>
<ul>
<li><p><a href="https://de.wikipedia.org/wiki/Logical_Volume_Manager">Logical Volume Manager - Wikipedia</a> (Deutsch)</p></li>
<li><p><a href="https://thelinuxexperiment.com/working-with-logical-volumes-part-1/">Working with logical volumes #1</a> (Englisch)</p></li>
<li><p><a href="https://thelinuxexperiment.com/working-with-logical-volumes-part-2/">Working with logical volumes #2</a> (Englisch)</p></li>
<li><p><a href="https://thelinuxexperiment.com/working-with-logical-volumes-part-3/">Working with logical volumes #3</a> (Englisch)</p></li>
<li><p><a href="https://developer.ibm.com/tutorials/l-resizing-partitions-2/">Gr&ouml;&szlig;en&auml;nderung von Linuxpartitionen - Teil 2 (IBM)</a> (Englisch)</p></li>
</ul>
<div id="rev">
Zuletzt bearbeitet: 2021-05-04
</div>
</body>
</html>
