<!DOCTYPE html>
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="de" lang="de">
<head>
<meta http-equiv="content-type" content="text/html; charset=UTF-8">
<meta charset="utf-8">
<meta name="generator" content="pandoc">
<meta name="viewport" content="width=device-width, initial-scale=1.0, user-scalable=yes">
<title>Systemd - Unit-Datei</title>
<style>
body            {font-family: Verdana, sans-serif; margin: 0 auto; float: none; max-width: 55em; padding: 4%; color: black;}
p, li           {line-height: 1.5;}
p img           {width: 1.5em; height: auto; border: 0.1em solid #CCC;}
p code, li code {display: inline; color: #000; padding: 0.1em; font-size: 1.2em;}
p.warning       {display: block; line-height: 1.3em; padding: 0.4em; background: #FFDDDD; border: 0.15em solid #C33; border-radius: 0.5em;}
p.warning code  {background: #FFDDDD; border: none;}
code            {display: block; max-width: 100%; background-color: #EEE; padding: 0.3em; border: #CCC thin solid; border-radius: 3px; font-size: 1.2em;}
pre             {color: #000; padding: 0.3em;}
pre code        {display: block; overflow:auto; max-width: 100%; color: #000; padding-bottom: 0.8em;}
li pre code     {padding: 0.3em 0.3em 0.8em 0.3em;}
table, th, td   {background-color: #EED; border: #CCC thin solid; border-collapse: collapse; padding: 0.15em;}
hr              {height: 0.2em; background-color: #CCC; border: 0; margin: 2em 0 2em 0;}
figcaption      {font-size: 0.8em; color: #888;}
figure img      {max-width: 85%; height: auto; border: 0.1em solid #CCC;}
a               {color: black; text-decoration: underline;}
a:visited       {color: #FF6600;}
a:hover         {color: #FFF; background-color: #FF6600; transition: all .25s ease-in;}
#rev            {float:right; font-size: 0.8em; color: #888;}
</style>
</head>
<body>
<header id="title-block-header">
<h1 class="title">Systemd - Unit-Datei</h1>
</header>
<nav id="TOC" role="doc-toc">
<ul>
<li><a href="#systemd-unit-datei">systemd unit-Datei</a>
<ul>
<li><a href="#ladepfad-der-unit-dateien">Ladepfad der Unit-Dateien</a></li>
<li><a href="#aktivierung-der-unit-datei">Aktivierung der Unit-Datei</a></li>
<li><a href="#sektionen-der-unit-datei">Sektionen der Unit-Datei</a>
<ul>
<li><a href="#sektion-unit">Sektion Unit</a></li>
<li><a href="#typ-spezifische-sektion">Typ-spezifische Sektion</a></li>
<li><a href="#sektion-install">Sektion Install</a></li>
</ul></li>
<li><a href="#beispiel-cupsd">Beispiel cupsd</a></li>
<li><a href="#werkzeuge">Werkzeuge</a></li>
<li><a href="#quellen-systemd-unit-datei">Quellen systemd-unit-Datei</a></li>
</ul></li>
</ul>
</nav>
<h2 id="systemd-unit-datei">systemd unit-Datei</h2>
<p>Die grundlegenden und einf&uuml;hrenden Informationen zu Systemd enth&auml;lt die Handbuchseite <a href="./systemd-start_de.html#systemd-der-system--und-dienste-manager">Systemd-Start</a><br />
In der vorliegenden Handbuchseite erkl&auml;ren wir den Aufbau der <strong>Unit-Dateien</strong> und die generischen Sektionen <em>[Unit]</em> und <em>[Install]</em>.</p>
<p>Die Unit-Datei ist eine reine Textdatei im INI-Format. Sie enth&auml;lt Konfigurationsanweisungen von der Art “Schl&uuml;ssel=Wert” in verschiedenen Sektionen. Leere Zeilen und solche, die mit “#” oder “;” beginnen, werden ignoriert. Alle Unit-Dateien m&uuml;ssen eine Sektion entsprechend des Unit-Typ enthalten. Die generischen Sektionen [Unit] am Beginn und [Install] am Ende der Datei sind optional, wobei die Sektion [Unit] dringend empfohlen wird.</p>
<h3 id="ladepfad-der-unit-dateien">Ladepfad der Unit-Dateien</h3>
<p>Die Ausgabe zeigt die Reihenfolge der Verzeichnisse, aus denen die Unit-Dateien geladen werden.</p>
<pre><code># systemd-analyze unit-paths
/etc/systemd/system.control
/run/systemd/system.control
/run/systemd/transient
/run/systemd/generator.early
/etc/systemd/system
/etc/systemd/system.attached
/run/systemd/system
/run/systemd/system.attached
/run/systemd/generator
/usr/local/lib/systemd/system
/lib/systemd/system
/usr/lib/systemd/system
/run/systemd/generator.late</code></pre>
<p>Unit-Dateien, die in fr&uuml;her aufgef&uuml;hrten Verzeichnissen gefunden werden, setzen Dateien mit dem gleichen Namen in Verzeichnissen, die weiter unten in der Liste aufgef&uuml;hrt sind, au&szlig;er Kraft. So hat eine Datei in <code>/etc/systemd/system</code> Vorrang vor der gleichnamigen in <code>/lib/systemd/system</code>.</p>
<p>Nur ein Teil der zuvor aufgef&uuml;hrten Verzeichnisse existiert per default in siduction. Die Verzeichnisse</p>
<ul>
<li><code>/lib/systemd/system/</code><br />
beinhalten System-Units, die durch den Paketverwalter der Distribution installiert wurden und ggf. vom Administrator erstellte Unit-Dateien.<br />
</li>
<li><code>/etc/systemd/system/</code><br />
beinhalten Symlinks auf Unit-Dateien in <code>/lib/systemd/system/</code> f&uuml;r aktivierte Units und ggf. vom Administrator erstellte Unit-Dateien.<br />
</li>
<li><code>/usr/local/lib/systemd/system/</code><br />
dieses Verzeichnis muss erstellt werden und ist f&uuml;r vom Administrator erstellte Unit-Dateien vorgesehen.<br />
</li>
<li><code>/run/systemd/</code><br />
beinhalten Laufzeit-Units und dynamische Konfiguration f&uuml;r fl&uuml;chtige Units. F&uuml;r den Administrator hat dieses Verzeichnis ausschlie&szlig;lich informellen Wert.</li>
</ul>
<p>Wir empfehlen eigene Unit-Dateien in <code>/usr/local/lib/systemd/system/</code> abzulegen.</p>
<h3 id="aktivierung-der-unit-datei">Aktivierung der Unit-Datei</h3>
<p>Um systemd die Konfiguration einer Unit zug&auml;nglich zu machen, muss die Unit-Datei aktiviert werden. Dies geschieht mit dem Aufruf:</p>
<pre><code># systemctl daemon-reload
# systemctl enable --now &lt;UNIT_DATEI&gt;</code></pre>
<p>Der erste Befehl l&auml;dt die komplette Daemon-Konfiguration neu, der zweite startet die Unit <UNIT_DATEI> sofort (Option <code>--now</code> ) und gliedert sie in systemd ein, sodass sie bei jedem Neustart des PC ausgef&uuml;hrt wird.<br />
Der Befehl</p>
<pre><code># systemctl disable &lt;UNIT_DATEI&gt;</code></pre>
<p>bewirkt, dass sie nicht mehr bei jedem Neustart des PC ausgef&uuml;hrt wird. Sie kann aber weiterhin manuell mit dem Befehl <strong><code>systemctl start &lt;UNIT_DATEI&gt;</code></strong> gestartet und mit <strong><code>systemctl stop &lt;UNIT_DATEI&gt;</code></strong> gestoppt werden.<br />
Falls eine Unit-Datei leer ist (d.h. die Gr&ouml;&szlig;e 0 hat) oder ein Symlink auf <code>/dev/null</code> ist, wird ihre Konfiguration nicht geladen und sie erscheint mit einem Ladezustand “masked” und kann nicht aktiviert werden. Dies ist eine wirksame Methode um eine Unit komplett zu deaktivieren und es auch unm&ouml;glich zu machen, sie manuell zu starten.</p>
<h3 id="sektionen-der-unit-datei">Sektionen der Unit-Datei</h3>
<p>Die Unit-Datei besteht in der Regel aus der Sektionen [Unit], der Typ-spezifischen Sektion und der Sektion [Install]. Die Typ-spezifische Sektion flie&szlig;t als Suffix in den Dateinamen ein. So besitzt zum Beispiel eine Unit-Datei, die einen Zeitgeber konfiguriert, immer die Endung “.timer” und muss [Timer] als Typ-spezifische Sektion enthalten.</p>
<h4 id="sektion-unit">Sektion Unit</h4>
<p>Diese Sektion enth&auml;lt allgemeine Informationen &uuml;ber die Unit, definiert Abh&auml;ngigkeiten zu anderen Units, wertet Bedingungen aus und sorgt f&uuml;r die Einreihung in den Bootprozess.</p>
<ol type="1">
<li><p>Allgemeine Optionen</p>
<ol type="a">
<li><p><code>Description=</code><br />
Identifiziert die Unit durch einen menschenlesbaren Namen, der von systemd als Bezeichnung f&uuml;r die Unit verwandt wird und somit im systemjournal erscheint (“Starting <em>description</em>…”) und dort als Suchmuster verwandt werden kann.</p></li>
<li><p><code>Documentation=</code><br />
Ein Verweis auf eine Datei oder Webseite, die Dokumentation f&uuml;r diese Unit oder ihre Konfiguration referenzieren. Z.B.:<br />
“Documentation=man:cupsd(8)” oder<br />
“Documentation=http://www.cups.org/doc/man-cupsd.html”.</p></li>
</ol></li>
<li><p>Bindungsabh&auml;ngigkeiten zu anderen Units</p>
<ol type="a">
<li><p><code>Wants=</code><br />
Hier aufgef&uuml;hrte Units werden mit der konfigurierten Unit gestartet.</p></li>
<li><p><code>Requires=</code><br />
&Auml;hnlich zu Wants=, erkl&auml;rt aber eine st&auml;rkere Bindung an die aufgef&uuml;hrten Units.<br />
Wenn diese Unit aktiviert wird, werden die aufgef&uuml;hrten Units ebenfalls aktiviert.<br />
Schl&auml;gt die Aktivierung einer der anderen Units fehl <strong>und</strong> die Ordnungsabh&auml;ngigkeit <code>After=</code> ist auf die fehlgeschlagene Unit gesetzt, dann wird diese Unit nicht gestartet.<br />
Falls eine der anderen Units inaktiv wird, bleibt diese Unit aktiv, nur wenn eine der anderen Units gestoppt wird, wird diese Unit auch gestoppt.</p></li>
<li><p><code>Requisite=</code><br />
&Auml;hnlich zu Requires=. Der Start dieser Unit wird sofort fehlschlagen, wenn die hier aufgef&uuml;hrten Units noch nicht gestartet wurden. Requisite= sollte mit der Ordnungsabh&auml;ngigkeit <code>After=</code> kombiniert werden, um sicherzustellen, dass diese Unit nicht vor der anderen Unit gestartet wird.</p></li>
<li><p><code>BindsTo=</code><br />
BindsTo= ist der st&auml;rkste Abh&auml;ngigkeitstyp: Es bewirkt zus&auml;tzlich zu den Eigenschaften von Requires=, dass die gebundene Unit im aktiven Status sein muss, damit diese Unit auch aktiv sein kann.<br />
Beim Stoppen oder inaktivem Zustand der gebundenen Unit wird diese Unit immer gestoppt.<br />
Um zu verhindern, dass der Start dieser Unit fehlschl&auml;gt, wenn die gebundene Unit nicht, oder noch nicht in einem aktiven Zustand ist, sollte BindsTo= am besten mit der Ordnungsabh&auml;ngigkeit <code>After=</code> kombiniert werden.</p></li>
<li><p><code>PartOf=</code><br />
&Auml;hnlich zu Requires=, aber begrenzt auf das Stoppen und Neustarten von Units.<br />
Wenn Systemd die hier aufgef&uuml;hrten Units stoppt oder neu startet, wird die Aktion zu dieser Unit weitergeleitet.<br />
Das ist eine Einwege-Abh&auml;ngigkeit. &Auml;nderungen an dieser Unit betreffen nicht die aufgef&uuml;hrten Units.</p></li>
<li><p><code>Conflicts=</code><br />
Deklariert negative Anforderungs-Abh&auml;ngigkeiten. Die Angabe einer durch Leerzeichen getrennten Liste ist m&ouml;glich.<br />
Conflicts= bewirkt, dass die aufgef&uuml;hrte Unit gestoppt wird, wenn diese Unit startet und umgekehrt.<br />
Da Conflicts= keine Ordnungs-Abh&auml;ngigkeit beinhaltet, muss eine Abh&auml;ngigkeit <code>After=</code> oder <code>Before=</code> erkl&auml;rt werden, um sicherzustellen, dass die in Konflikt stehende Unit gestoppt wird, bevor die andere Unit gestartet wird.</p></li>
</ol></li>
<li><p>Ordnungsabh&auml;ngigkeiten zu anderen Units</p>
<ol type="a">
<li><p><code>Before=</code><br />
Diese Einstellung konfiguriert Ordnungsabh&auml;ngigkeiten zwischen Units. Before= stellt sicher, dass die aufgef&uuml;hrte Unit erst mit dem Starten beginnt, nachdem der Start der konfigurierten Unit abgeschlossen ist.<br />
Die Angabe einer durch Leerzeichen getrennten Liste ist m&ouml;glich.</p></li>
<li><p><code>After=</code><br />
Diese Einstellung stellt das Gegenteil von Before= sicher. Die aufgef&uuml;hrte Unit muss vollst&auml;ndig gestartet sein, bevor die konfigurierte Unit gestartet wird.</p></li>
<li><p><code>OnFailure=</code><br />
Units, die aktiviert werden, wenn diese Unit den Zustand “failed” einnimmt.</p></li>
</ol></li>
<li><p>Bedingungen<br />
Unit-Dateien k&ouml;nnen auch eine Reihe von Bedingungen enthalten.<br />
Bevor die Unit gestartet wird, wird Systemd nachweisen, dass die festgelegten Bedingungen wahr sind. Falls nicht, wird das Starten der Unit (fast ohne Ausgabe) &uuml;bersprungen.<br />
Fehlschlagende Bedingungen f&uuml;hren nicht dazu, dass die Unit in den Zustand »failed« &uuml;berf&uuml;hrt wird.<br />
Falls mehrere Bedingungen festgelegt sind, wird die Unit ausgef&uuml;hrt, falls alle von ihnen zutreffen.<br />
In diesem Abschnitt f&uuml;hren wir nur Bedingungen auf, die uns f&uuml;r selbst erstellte Units hilfreich erscheinen, denn viele Bedingungen dienen dazu, um Units zu &uuml;berspringen, die auf dem lokalen System nicht zutreffen.<br />
Der Befehl <strong><code>systemd-analyze verify &lt;UNIT_DATEI&gt;</code></strong> kann zum Testen von Bedingungen verwandt werden.</p>
<ol type="a">
<li><p><code>ConditionVirtualization=</code><br />
Pr&uuml;ft, ob das System in einer virtualisierten Umgebung ausgef&uuml;hrt wird und testet optional, ob es eine bestimmte Implementierung ist.</p></li>
<li><p><code>ConditionACPower=</code><br />
Pr&uuml;ft, ob das System zum Zeitpunkt der Aktivierung der Unit am Netz h&auml;ngt oder ausschlie&szlig;lich &uuml;ber Akku l&auml;uft.</p></li>
<li><p><code>ConditionPathExists=</code><br />
Pr&uuml;ft auf die Existenz einer Datei. Mit einem Ausrufezeichen (“!”) vor dem Pfad wird der Test negiert.</p></li>
<li><p><code>ConditionPathExistsGlob=</code><br />
Wie zuvor, nur dass ein Suchmuster angegeben wird. Mit einem Ausrufezeichen (“!”) vor dem Pfad wird der Test negiert.</p></li>
<li><p><code>ConditionPathIsDirectory=</code><br />
Pr&uuml;ft auf die Existenz eines Verzeichnisses. Mit einem Ausrufezeichen (“!”) vor dem Pfad wird der Test negiert.</p></li>
<li><p><code>ConditionPathIsSymbolicLink=</code><br />
&Uuml;berpr&uuml;ft ob ein bestimmter Pfad existiert und ein symbolischer Link ist. Mit einem Ausrufezeichen (“!”) vor dem Pfad wird der Test negiert.</p></li>
<li><p><code>ConditionPathIsMountPoint=</code><br />
&Uuml;berpr&uuml;ft ob ein bestimmter Pfad existiert und ein Einh&auml;ngepunkt ist. Mit einem Ausrufezeichen (“!”) vor dem Pfad wird der Test negiert.</p></li>
<li><p><code>ConditionPathIsReadWrite=</code><br />
&Uuml;berpr&uuml;ft ob das zugrundeliegende Dateisystem les- und schreibbar ist. Mit einem Ausrufezeichen (“!”) vor dem Pfad wird der Test negiert.</p></li>
<li><p><code>ConditionDirectoryNotEmpty=</code><br />
&Uuml;berpr&uuml;ft ob ein bestimmter Pfad existiert und ein nicht leeres Verzeichnis ist. Mit einem Ausrufezeichen (“!”) vor dem Pfad wird der Test negiert.</p></li>
<li><p><code>ConditionFileNotEmpty=</code><br />
&Uuml;berpr&uuml;ft ob ein bestimmter Pfad existiert und sich auf eine normale Datei mit einer von Null verschiedenen Gr&ouml;&szlig;e bezieht. Mit einem Ausrufezeichen (“!”) vor dem Pfad wird der Test negiert.</p></li>
<li><p><code>ConditionFileIsExecutable=</code><br />
&Uuml;berpr&uuml;ft ob ein bestimmter Pfad existiert und sich auf eine normale, als ausf&uuml;hrbar gekennzeichnete Datei bezieht. Mit einem Ausrufezeichen (“!”) vor dem Pfad wird der Test negiert.</p></li>
</ol></li>
</ol>
<p>Die vollst&auml;ndige Dokumentation zu allen Optionen der Sektion [Unit] bitte in der <a target="_blank" href="https://manpages.debian.org/testing/manpages-de/systemd.unit.5.de.html">Deutschen Manpage, systemd.unit</a> nachlesen.</p>
<h4 id="typ-spezifische-sektion">Typ-spezifische Sektion</h4>
<p>Diese Sektion enth&auml;lt die speziellen Optionen der elf m&ouml;glichen Typen. Ausf&uuml;hrliche Beschreibungen enthalten die verlinkten Handbuchseiten, oder ersatzweise die jeweilige deutsche Manpage.</p>
<ul>
<li><p><a href="./systemd-service_de.html#systemd-service">[Service]</a> konfiguriert einen Dienst</p></li>
<li><p><a target="_blank" href="https://manpages.debian.org/testing/manpages-de/systemd.socket.5.de.html">[Socket]</a> konfiguriert ein Socket</p></li>
<li><p><a target="_blank" href="https://manpages.debian.org/testing/manpages-de/systemd.device.5.de.html">[Device]</a> konfiguriert ein Ger&auml;t</p></li>
<li><p><a href="./systemd-mount_de.html#systemd-mount">[Mount]</a> konfiguriert einen Einh&auml;ngepunkt</p></li>
<li><p><a href="./systemd-mount_de.html#systemd-mount">[Automount]</a> konfiguriert einen Selbsteinh&auml;ngepunkt</p></li>
<li><p><a target="_blank" href="https://manpages.debian.org/testing/manpages-de/systemd.swap.5.de.html">[Swap]</a> konfiguriert eine Auslagerungsdatei oder -partition</p></li>
<li><p><a href="./systemd-target_de.html#systemd-target---ziel-unit">[Target]</a> konfiguriert ein Startziel</p></li>
<li><p><a href="./systemd-path_de.html#systemd-path">[Path]</a> konfiguriert einen &uuml;berwachten Dateipfad</p></li>
<li><p><a href="./systemd-timer_de.html#systemd-timer">[Timer]</a> konfiguriert einen von systemd gesteuerten und &uuml;berwachten Zeitgeber</p></li>
<li><p><a target="_blank" href="https://manpages.debian.org/testing/manpages-de/systemd.slice.5.de.html">[Slice]</a> konfiguriert eine Ressourcenverwaltungs-Slice</p></li>
<li><p><a target="_blank" href="https://manpages.debian.org/testing/manpages-de/systemd.scope.5.de.html">[Scope]</a> konfiguriert eine Gruppe von extern erstellten Prozessen.</p></li>
</ul>
<h4 id="sektion-install">Sektion Install</h4>
<p>Unit-Dateien k&ouml;nnen diese Sektion enthalten.<br />
Die Optionen der [Install]-Sektion werden von den Befehlen <strong><code>systemctl enable &lt;UNIT_DATEI&gt;</code></strong> und <strong><code>systemctl disable &lt;UNIT_DATEI&gt;</code></strong> w&auml;hrend der Installation einer Unit verwandt.<br />
Unit-Dateien ohne [Install]-Sektion lassen sich manuell mit dem Befehl <strong><code>systemctl start &lt;UNIT_DATEI&gt;</code></strong>, oder von einer anderen Unit-Datei starten.</p>
<p>Beschreibung der Optionen:</p>
<ul>
<li><p><code>Alias=</code><br />
Eine Liste von zus&auml;tzlichen Namen, unter der diese Unit installiert werden soll. Die hier aufgef&uuml;hrten Namen m&uuml;ssen die gleiche Endung wie die Unit-Datei haben.</p></li>
<li><p><code>WantedBy=</code><br />
Diese Option kann mehrfach verwendet werden oder eine durch Leerzeichen getrennte Liste enthalten.<br />
Im <code>.wants/</code>-Verzeichnis jeder der aufgef&uuml;hrten Units wird bei der Installation ein symbolischer Link erstellt. Dadurch wird eine Abh&auml;ngigkeit vom Typ <code>Wants=</code> von der aufgef&uuml;hrten Unit zu der aktuellen Unit hinzugef&uuml;gt. Das Hauptergebnis besteht darin, dass die aktuelle Unit gestartet wird, wenn die aufgef&uuml;hrte Unit gestartet wird.<br />
Verh&auml;lt sich wie die Option Wants= in der Sektion [Unit].</p>
<p>Beispiel:<br />
WantedBy=graphical.target</p>
<p>Das teilt systemd mit, die Unit beim Starten von graphical.target (fr&uuml;her “init 5”) hereinzuziehen.</p></li>
<li><p><code>RequiredBy=</code><br />
Diese Option kann mehrfach verwendet werden oder eine durch Leerzeichen getrennte Liste enthalten.<br />
Im <code>.requires/</code>-Verzeichnis jeder der aufgef&uuml;hrten Units wird bei der Installation ein symbolischer Link erstellt. Dadurch wird eine Abh&auml;ngigkeit vom Typ <code>Requires=</code> von der aufgef&uuml;hrten Unit zu der aktuellen Unit hinzugef&uuml;gt. Das Hauptergebnis besteht darin, dass die aktuelle Unit gestartet wird, wenn die aufgef&uuml;hrte Unit gestartet wird.<br />
Verh&auml;lt sich wie die Option Requires= in der Sektion [Unit].</p></li>
<li><p><code>Also=</code><br />
Zus&auml;tzliche Units, die installiert/deinstalliert werden sollen, wenn diese Unit installiert/deinstalliert wird.</p></li>
<li><p><code>DefaultInstance=</code><br />
Diese Option zeigt nur bei Vorlagen-Unit-Dateien Wirkung.<br />
Deklariert, welche Instanz der Unit freigegeben werden soll. Die angegebene Zeichenkette muss zur Identifizierung einer Instanz geeignet sein.</p></li>
</ul>
<p>Hinweis: Um die Konfiguration einer Unit-Datei zu pr&uuml;fen, eignet sich der Befehl <strong><code>systemd-analyze verify &lt;UNIT_DATEI&gt;</code></strong>.</p>
<h3 id="beispiel-cupsd">Beispiel cupsd</h3>
<p>Der <em>“cupsd”</em>, Auftragsplaner (Scheduler) f&uuml;r das Common UNIX Printing System, wird von systemd mit seinen drei Unit Dateien <code>cups.socket</code>, <code>cups.service</code> und <code>cups.path</code> gesteuert und eignet sich gut, um die Abh&auml;ngigkeiten zu verdeutlichen.<br />
Hier die drei Dateien.</p>
<pre><code>Datei /lib/systemd/system/cups.service:

[Unit]
Description=CUPS Scheduler
Documentation=man:cupsd(8)
After=network.target sssd.service ypbind.service nslcd.service
Requires=cups.socket
    After=cups.socket
     (nicht in der Datei, da implizit vorhanden.)
    After=cups.path
     (nicht in der Datei, da implizit vorhanden.)

[Service]
ExecStart=/usr/sbin/cupsd -l
Type=notify
Restart=on-failure

[Install]
Also=cups.socket cups.path
WantedBy=printer.target</code></pre>
<pre><code>Datei /lib/systemd/system/cups.path:

[Unit]
Description=CUPS Scheduler
PartOf=cups.service
    Before=cups.service
     (nicht in der Datei, da implizit vorhanden.)

[Path]
PathExists=/var/cache/cups/org.cups.cupsd

[Install]
WantedBy=multi-user.target</code></pre>
<pre><code>Datei /lib/systemd/system/cups.socket:

[Unit]
Description=CUPS Scheduler
PartOf=cups.service
    Before=cups.service
     (nicht in der Datei, da implizit vorhanden.)

[Socket]
ListenStream=/run/cups/cups.sock

[Install]
WantedBy=sockets.target</code></pre>
<p><strong>Die Sektion [Unit]</strong><br />
enth&auml;lt f&uuml;r alle drei Dateien die gleiche Beschreibung. Die Dateien <code>cups.path</code> und <code>cups.socket</code> enthalten zus&auml;tzlich die Bindungsabh&auml;ngigkeit <code>PartOf=cups.service</code>, was bedeutet, dass diese zwei Units abh&auml;ngig von cups.service gestoppt oder neu gestartet werden.<br />
Die socket-Unit ebenso wie die path-Unit schlie&szlig;en die Ordnungsabh&auml;ngigkeit <code>Before=</code> zu ihrer namensgleichen service-Unit ein. Deshalb ist es nicht notwendig in der cups.service-Unit die Ordnungs-Abh&auml;ngigkeiten After=cups.socket und After=cups.path einzutragen. (Siehe unten die Ausgabe von <em>“systemd-analyze dump”</em> mit dem Vermerk <em>“destination-implicit”</em>.) Beide Abh&auml;ngigkeiten gemeinsam bewirken, dass unabh&auml;ngig davon, welche Unit zuerst startet, immer alle drei Units starten und die cups.service-Unit erst, nachdem der Start der cups.path-Unit und der cups.socket-Unit erfolgreich abgeschlossen wurde.</p>
<p>Die vollst&auml;ndige Konfiguration der Units erhalten wir mit dem Befehl <strong><code>systemd-analyze dump</code></strong>, der eine sehr, sehr lange Liste ( &gt; 32000 Zeilen) des systemd Serverstatus ausgibt.</p>
<pre><code># systemd-analyze dump
[...]
-&gt; Unit cups.service:
    Description: CUPS Scheduler.service
    [...]
    WantedBy: printer.target (destination-file)
    ConsistsOf: cups.socket (destination-file)
    ConsistsOf: cups.path (destination-file)
    Before: printer.target (destination-default)
    After: cups.socket (destination-implicit)
    After: cups.path (destination-implicit)
[...]
-&gt; Unit printer.target:
    Description: Printer
    [...]
    Wants: cups.service (origin-file)
    After: cups.service (origin-default)
[...]</code></pre>
<p><strong>Die Sektion [Install]</strong><br />
der cups.service-Unit enth&auml;lt mit der Option <code>Also=cups.socket cups.path</code> die Anweisung, diese beiden Units auch zu installieren und alle drei Units haben unterschiedliche <code>WantedBy=</code> Optionen:</p>
<ul>
<li>cups.socket: WantedBy=sockets.target</li>
<li>cups.path: WantedBy=multi-user.target</li>
<li>cups.service: WantedBy=printer.target</li>
</ul>
<p>Um zu verstehen, warum unterschiedliche Werte f&uuml;r die Option <em>“WantedBy=”</em> Verwendung finden, ben&ouml;tigen wir zus&auml;tzliche Informationen, die wir mit den Befehlen <strong><code>systemd-analyze dot</code></strong> und <strong><code>systemd-analyze plot</code></strong> erhalten.</p>
<pre><code>   (in einer Zeile eingeben)
$ systemd-analyze dot --to-pattern=&#39;*.target&#39;
 --from-pattern=&#39;*.target&#39; | dot -Tsvg &gt; targets.svg

$ systemd-analyze plot &gt; bootup.svg</code></pre>
<p>Der erste liefert uns ein Flussdiagramm mit den Abh&auml;ngigkeiten der verschiedenen Targets zueinander und der zweite eine graphisch aufbereitete Auflistung des Bootprozesses mit den Zeitpunkten wann ein Prozess gestartet wurde, welche Zeit er beanspruchte und seinen Aktivit&auml;tszustand.</p>
<p>Der <code>targets.svg</code> und der <code>bootup.svg</code> entnehmen wir, dass</p>
<ol type="1">
<li><p><em>sysinit.target</em><br />
aktiviert wird und</p></li>
<li><p><em>basic.target</em><br />
erst startet, wenn sysinit.target erreicht wurde.</p>
<p>2.1. <em>sockets.target</em><br />
von basic.target angefordert wird,</p>
<p>2.1.1. <em>cups.socket</em><br />
und alle weiteren .socket-Units von sockets.target hereingeholt werden.</p>
<p>2.2. <em>paths.target</em><br />
von basic.target angefordert wird,</p>
<p>2.2.1. <em>cups.path</em><br />
und alle weiteren .path-Units von paths.target hereingeholt werden.</p></li>
<li><p><em>network.target</em><br />
erst startet, wenn basic.target erreicht wurde.</p></li>
<li><p><em>cups.service</em><br />
erst startet, wenn network.target erreicht wurde.</p></li>
<li><p><em>multi-user.target</em><br />
erst startet, wenn network.target erreicht wurde.</p></li>
<li><p><em>multi-user.target</em><br />
erst dann erreicht wird, wenn cups.service erfolgreich gestartet wurde. (Genau genommen liegt es daran, dass der cups-browsed.service, der vom cups.service abh&auml;ngt, erfolgreich gestartet sein muss.)</p></li>
<li><p><em>printer.target</em><br />
wird erst aktiv, wenn systemd dynamisch Ger&auml;te-Units f&uuml;r die Drucker generiert.Dazu m&uuml;ssen die Drucker angeschlossen und eingeschaltet sein.</p></li>
</ol>
<p>Weiter oben stellten wir fest, dass der Start einer cups.xxx-Unit ausreicht, um alle drei Units hereinzuholen. Betrachten wir noch einmal die "<em>WantedBy="</em>-Optionen in der [Install]-Sektion, so haben wir die cups.socket-Unit, die &uuml;ber das sockets.target bereits w&auml;hrend des basic.target hereingeholt wird, die cups.path-Unit, die w&auml;hrend des multi-user.target hereingeholt wird und den cups.service, der vom printer.target hereingeholt wird.<br />
W&auml;hrend des gesamten Bootprozesses werden die drei cups.xxx-Units wiederholt bei systemd zur Aktivierung angefordert. Das h&auml;rtet den cupsd gegen unvorhergesehene Fehler, spielt f&uuml;r systemd aber keine Rolle, denn es ist unerheblich wie oft ein Service angefordert wird, wenn er sich in der Warteschlange befindet.<br />
Zus&auml;tzlich fordert immer dann das printer.target den cups.service an, wenn ein Drucker neu von systemd erkannt wird.</p>
<h3 id="werkzeuge">Werkzeuge</h3>
<p>Systemd beinhaltet einige n&uuml;tzliche Werkzeuge f&uuml;r die Analyse, Pr&uuml;fung und Bearbeitung der Unit-Dateien.<br />
Bitte auch die Manpages <a target="_blank" href="https://manpages.debian.org/testing/manpages-de/systemd-analyze.1.de.html">systemd-analyze</a> und <a target="_blank" href="https://manpages.debian.org/testing/manpages-de/systemctl.1.de.html">systemctl</a> zu Rate ziehen.</p>
<ul>
<li><p>edit</p>
<pre><code># systemctl edit &lt;UNIT_DATEI&gt;
# systemctl edit --full &lt;UNIT_DATEI&gt;
# systemctl edit --full --force &lt;UNIT_DATEI&gt;</code></pre>
<p><em>“systemctl edit”</em> &ouml;ffnet die ausgew&auml;hlte Unit-Datei im konfigurierten Editor.</p>
<ul>
<li><p><strong><code>systemctl edit &lt;UNIT_DATEI&gt;</code></strong><br />
erstellt unterhalb <code>/etc/systemd/system/</code> ein neues Verzeichnis mit dem Namen <code>&lt;UNIT_DATEI&gt;.d</code> und darin die Datei <code>override.conf</code>, die ausschlie&szlig;lich die &Auml;nderungen gegen&uuml;ber der urspr&uuml;nglichen Unit-Datei enth&auml;lt. Dies gilt f&uuml;r alle Unit-Dateien in den Verzeichnissen, die in der <a href="./systemd-unit-datei_de.html#ladepfad-der-unit-dateien">Hierarchie der Ladepfade</a> inklusive <code>/etc/systemd/system/</code> abw&auml;rts eingetragen sind.</p></li>
<li><p><strong><code>systemctl edit --full &lt;UNIT_DATEI&gt;</code></strong><br />
erstellt eine neue, namensgleiche Datei im Verzeichnis <code>/etc/systemd/system/</code>. Dies gilt f&uuml;r alle Unit-Dateien in den Verzeichnissen, die in der <a href="./systemd-unit-datei_de.html#ladepfad-der-unit-dateien">Hierarchie der Ladepfade</a> unterhalb <code>/etc/systemd/system/</code> eingetragen sind. Dateien, die sich bereits im Verzeichnis <code>/etc/systemd/system/</code> befinden, werden &uuml;berschrieben.</p></li>
<li><p><strong><code>systemctl edit --full --force &lt;UNIT_DATEI&gt;</code></strong><br />
erstellt eine neue Datei im Verzeichnis <code>/etc/systemd/system/</code>. Ohne die Option <code>--full</code> w&uuml;rde nur eine Datei <code>override.conf</code> im neuen Verzeichnis <code>/etc/systemd/system/&lt;UNIT_DATEI&gt;.d</code> generiert, der die zugeh&ouml;rige Unit-Datei fehlt.</p></li>
</ul>
<p>Wird der Editor beendet, so f&uuml;hrt systemd automatisch den Befehl <strong><code>systemctl daemon-reload</code></strong> aus.</p></li>
<li><p>revert</p>
<pre><code># systemctl revert &lt;UNIT_DATEI&gt;</code></pre>
<p>macht die mit <code>systemctl edit</code> und <code>systemctl edit --full</code> vorgenommenen &Auml;nderungen an Unit-Dateien r&uuml;ckg&auml;ngig. Dies gilt nicht f&uuml;r ge&auml;nderte Unit-Dateien die sich bereits im Verzeichnis <code>/etc/systemd/system/</code> befanden.<br />
Zus&auml;tzlich bewirkt der Befehl die R&uuml;cknahme der mit <code>systemctl mask</code> vorgenommenen &Auml;nderungen.</p></li>
<li><p>daemon-reload</p>
<pre><code># systemctl daemon-reload</code></pre>
<p>L&auml;dt die Systemverwalterkonfiguration neu. Dies f&uuml;hrt alle Generatoren neu aus, l&auml;dt alle Unit-Dateien neu und erstellt den gesamten Abh&auml;ngigkeitsbaum neu.</p></li>
<li><p>cat</p>
<pre><code>$ systemctl cat &lt;UNIT_DATEI&gt;</code></pre>
<p>Gibt entsprechend des Konsolebefehls <code>cat</code> den Inhalt der Unit-Datei und aller zugeh&ouml;rigen &Auml;nderungen aus.</p></li>
<li><p>analyze verify</p>
<pre><code>$ systemd-analyze verify &lt;UNIT_DATEI&gt;</code></pre>
<p>&uuml;berpr&uuml;ft die Konfigurationseinstellungen einer Unit-Datei und gibt Hinweise aus. Dies ist ein sehr hilfreicher Befehl um die Konfiguration selbst erstellter oder ge&auml;nderter Unit-Dateien zu pr&uuml;fen.</p></li>
<li><p>systemd-delta</p>
<pre><code>$ systemd-delta</code></pre>
<p>pr&auml;sentiert in der Ausgabe Unit-Dateien und die vorgenommenen &Auml;nderungen an ihnen. Das Schl&uuml;sselwort am Anfang der Zeile definiert die Art der &Auml;nderung bzw. Konfiguration.<br />
Hier ein Beispiel:</p>
<pre><code>$ systemd-delta --no-pager
[MASKED]     /etc/sysctl.d/50-coredump.conf → /usr/lib/sysctl.d/50-coredump.conf
[OVERRIDDEN] /etc/tmpfiles.d/screen-cleanup.conf → /usr/lib/tmpfiles.d/screen-cleanup.conf
[MASKED]     /etc/systemd/system/NetworkManager-wait-online.service → /lib/systemd/system/NetworkManager-wait-online.service
[EQUIVALENT] /etc/systemd/system/tmp.mount → /lib/systemd/system/tmp.mount
[EXTENDED]   /lib/systemd/system/rc-local.service → /lib/systemd/system/rc-local.service.d/debian.conf
[EXTENDED]   /lib/systemd/system/systemd-localed.service → /lib/systemd/system/systemd-localed.service.d/locale-gen.conf
6 overridden configuration files found.</code></pre></li>
<li><p>analyze dump</p>
<pre><code>$ systemd-analyze dump &gt; systemd_dump.txt</code></pre>
<p>erstellt die Textdatei <em>“systemd_dump.txt”</em> mit der vollst&auml;ndigen Konfiguration alle Units des systemd. Die sehr lange Textdatei gibt Aufschluss &uuml;ber alle Konfigurationseinstellungen aller systemd-Units und l&auml;sst sich mit einem Texteditor und unter Verwendung von RegEx-Pattern gut durchsuchen.</p></li>
<li><p>analyze plot</p>
<pre><code>$ systemd-analyze plot &gt; bootup.svg</code></pre>
<p>erstellt die Datei <em>“bootup.svg”</em> mit der zeitlichen Abfolge des Bootprozesses. Es ist eine graphisch aufbereitete Auflistung des Bootprozesses mit den Start- und Endzeitpunkten aller Units, welche Zeit sie beanspruchten und ihren Aktivit&auml;tszust&auml;nden.</p></li>
<li><p>analyze dot (Den Befehl auf einer Zeile eingeben.)</p>
<pre><code>$ systemd-analyze dot --to-pattern=&#39;*.target&#39;
 --from-pattern=&#39;*.target&#39; | dot -Tsvg &gt; targets.svg

  Color legend: black     = Requires
                dark blue = Requisite
                dark grey = Wants
                red       = Conflicts
                green     = After</code></pre>
<p>erstellt das Flussdiagramm <em>“targets.svg”</em>, dass die Abh&auml;ngigkeiten der im Bootprozess verwendeten Targets darstellt. Die Beziehungen der target-Units werden zur besseren &Uuml;bersicht farblich dargestellt.</p></li>
</ul>
<p>Die hier genannten Hilfsmittel stellen nur einen Teil der mit systemd ausgelieferten Werkzeuge dar. Bitte entnehme den man-Pages die vollst&auml;ndige Dokumentation.</p>
<h3 id="quellen-systemd-unit-datei">Quellen systemd-unit-Datei</h3>
<p><a target="_blank" href="https://manpages.debian.org/testing/manpages-de/systemd.unit.5.de.html">Deutsche Manpage, systemd.unit</a><br />
<a target="_blank" href="https://manpages.debian.org/testing/manpages-de/systemd.syntax.7.de.html">Deutsche Manpage, systemd.syntax</a><br />
<a target="_blank" href="https://manpages.debian.org/testing/manpages-de/systemd.device.5.de.html">Deutsche Manpage, systemd.device</a><br />
<a target="_blank" href="https://manpages.debian.org/testing/manpages-de/systemd.scope.5.de.html">Deutsche Manpage, systemd.scope</a><br />
<a target="_blank" href="https://manpages.debian.org/testing/manpages-de/systemd.slice.5.de.html">Deutsche Manpage, systemd.slice</a><br />
<a target="_blank" href="https://manpages.debian.org/testing/manpages-de/systemd.socket.5.de.html">Deutsche Manpage, systemd.socket</a><br />
<a target="_blank" href="https://manpages.debian.org/testing/manpages-de/systemd.swap.5.de.html">Deutsche Manpage, systemd.swap</a><br />
<a target="_blank" href="https://manpages.debian.org/testing/manpages-de/systemd-analyze.1.de.html">Deutsche Manpage, systemd-analyze</a><br />
<a target="_blank" href="https://manpages.debian.org/testing/manpages-de/systemctl.1.de.html">Deutsche Manpage, systemctl</a></p>
<p>Dank an Helge Kreuzmann f&uuml;r die deutschen &Uuml;bersetzungen.</p>
<div id="rev">
Seite zuletzt aktualisiert 2021-11-29
</div>
</body>
</html>
