<!DOCTYPE html>
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="" lang="">
<head>
<meta http-equiv="content-type" content="text/html; charset=UTF-8">
<meta charset="utf-8">
<meta name="generator" content="pandoc">
<meta name="viewport" content="width=device-width, initial-scale=1.0, user-scalable=yes">
<title>Systemjournal</title>
<style>
body            {font-family: Verdana, sans-serif; margin: 0 auto; float: left; max-width: 1000px; padding: 4%; border: #CCC thin solid; color: black;}
p               {line-height: 1.4;}
code            {display: block; background-color: #EEE; padding: 0.5em; border: #CCC thin solid; border-radius: 3px;}
p code, li code {display: inline; color: #000; padding: 0.15em; font-size: 1.2em;}
pre code        {display: block; color: #000; padding: 0.15em; font-size: 1.2em;}
table, th, td   {background-color: #EED; border: #CCC thin solid; border-collapse: collapse; padding: 0.15em;}
hr              {height: 0.2em; background-color: #CCC; border: 0; margin: 2em 0 2em 0;}
figcaption      {font-size: 0.8em; color: #888;}
warning         {display: block; line-height: 1.3em; padding: 0.4em; background: #FFDDDD; border: 0.15em solid #C33; border-radius: 0.5em;}
img             {border: 0.1em solid #CCC;}
a               {color: black; text-decoration: underline;}
a:visited       {color: #FF6600;}
a:hover         {color: #FFF; background-color: #FF6600; transition: all .25s ease-in;}
#rev            {float:right; font-size: 0.8em; color: #888;}
</style>
</head>
<body>
<header id="title-block-header">
<h1 class="title">Systemjournal</h1>
</header>
<nav id="TOC" role="doc-toc">
<ul>
<li><a href="#systemjournal">Systemjournal</a>
<ul>
<li><a href="#journald">journald</a></li>
<li><a href="#journald-&uuml;ber-das-netzwerk">journald &uuml;ber das Netzwerk</a></li>
<li><a href="#journald.conf">journald.conf</a></li>
<li><a href="#journalctl">journalctl</a></li>
<li><a href="#journalctl-beherrschen">journalctl beherrschen</a></li>
<li><a href="#quellen-journald">Quellen journald</a></li>
</ul></li>
</ul>
</nav>
<h2 id="systemjournal">Systemjournal</h2>
<p>Das Systemjournal besteht aus dem <em>systemd-journald</em>, kurz <strong>journald</strong>, der Protokollmeldungen sammelt und speichert, und dem <strong>journalctl</strong>, das der Verwaltung, Abfrage und Ausgabe der gesammelten Protokollmeldungen dient.</p>
<h3 id="journald">journald</h3>
<p><em>journald</em> ist ein Systemdienst, der mit Hilfe der Unit <em>systemd-journald.service</em> (und seiner zugeh&ouml;rigen Socket-Units) Protokollmeldungen sammelt und speichert.<br />
Es erstellt und verwaltet strukturierte, indizierte Journale, basierend auf den Protokollmeldungen aus:</p>
<ul>
<li>Kernel-Protokollmeldungen</li>
<li>Einfache System-Protokollmeldungen</li>
<li>Strukturierte System-Protokollmeldungen &uuml;ber die native Journal-API</li>
<li>Standardausgabe und Standardfehlerausgabe der Dienste-Units</li>
<li>Audit-Aufzeichnungen, stammend aus dem Kernel-Audit-Subsystem</li>
</ul>
<p><em>journald</em> erlaubt Journal-“Namensr&auml;ume” (namespaces). Sie sind zum Einen ein Mechanismus zur logischen Isolation eines Protokoll-Datenstroms vom Rest des Systems, zum Anderen auch ein Mechanismus zur Steigerung der Leistung. Journal-Namensr&auml;ume existieren gleichzeitig und nebeneinander. Jeder hat seinen eigenen, unabh&auml;ngigen Protokolldatenstrom. Nach der Installation von siduction besteht nur der Vorgabe-Namensraum des Systems.</p>
<p>Der <em>journald</em> speichert die Protokolldaten standardm&auml;&szlig;ig dauerhaft unter<br />
<code>/var/log/journal/MASCHINENKENNUNG</code>.</p>
<p>Protokolldaten f&uuml;r andere Namensr&auml;ume befinden sich in<br />
<code>/var/log/journal/MASCHINENKENNUNG.NAMENSRAUM</code>.</p>
<p>Der Befehl <strong><code>systemd-cat</code></strong> bietet zwei M&ouml;glichkeiten um unabh&auml;ngig von systemd-Units Daten eines Prozesses an das Journal weiterzugeben.</p>
<ol type="1">
<li><strong><code>systemd-cat &lt;Programm&gt; &lt;Option(en)&gt;</code></strong><br />
Mit einem Programmaufruf oder Befehl verwendet, leitet <em>systemd-cat</em> alle Standardeingaben, Standardausgaben und Standardfehlerausgaben eines Prozesses zum Journal um.<br />
</li>
<li><strong>In einer Pipe verwendet,</strong><br />
dient <em>systemd-cat</em> als Filterwerkzeug, um die zuvor erstellte Ausgabe an das Journal zu senden.</li>
</ol>
<p>Falls kein Parameter &uuml;bergeben wurde, wird <em>systemd-cat</em> alles, was es von der Standardeingabe liest, an das Journal schicken. Die man-page <a href="https://manpages.debian.org/testing/manpages-de/systemd-cat.1.de.html">systemd-cat.1.de</a> bietet weitere Informationen.</p>
<h3 id="journald-&uuml;ber-das-netzwerk">journald &uuml;ber das Netzwerk</h3>
<p>Die <em>systemd-journal</em>-Module <em>upload</em>, <em>remote</em> und <em>gatewayd</em> erm&ouml;glichen das Versenden und Empfangen von System-Protokolldaten zwischen verschiedenen Rechnern &uuml;ber das Netzwerk. Mit ihrer Hilfe lassen sich entfernte Rechner fortlaufend &uuml;berwachen. In dieser Konstellation ist es sinnvoll auf dem Remoterechner Namensr&auml;ume f&uuml;r die Protokolldaten der entfernten Rechner einzurichten.<br />
F&uuml;r weitere Informationen bitte die man-pages <a href="https://manpages.debian.org/testing/manpages-de/systemd-journal-upload.8.de.html">journal upload</a>, <a href="https://manpages.debian.org/testing/manpages-de/systemd-journal-remote.8.de.html">journal remote</a> und <a href="https://manpages.debian.org/testing/manpages-de/systemd-journal-gatewayd.8.de.html">journal gatewayd</a> lesen.</p>
<h3 id="journald.conf">journald.conf</h3>
<p>Die folgenden Dateien konfigurieren verschiedene Parameter des systemd-Journal-Dienstes.</p>
<ul>
<li>/etc/systemd/journald.conf</li>
<li>/etc/systemd/journald.conf.d/*.conf</li>
<li>/etc/systemd/journald@NAMENSRAUM.conf (optional)</li>
<li>/run/systemd/journald.conf.d/*.conf (optional)</li>
<li>/usr/lib/systemd/journald.conf.d/*.conf (optional)</li>
</ul>
<p>Der Vorgabe-Namensraum, den der systemd-journald.service (und seine zugeh&ouml;rigen Socket-Units) verwaltet, wird in <code>/etc/systemd/journald.conf</code> und zugeordneten Erg&auml;nzungen konfiguriert.<br />
Die Konfigurationsdatei enth&auml;lt die Vorgaben als auskommentierten Hinweis f&uuml;r den Administrator. Um lokal Einstellungen zu &auml;ndern, gen&uuml;gt es diese Datei zu bearbeiten.</p>
<p>Instanzen, die andere Namensr&auml;ume verwalten, werden nur ben&ouml;tigt, wenn von den Vorgaben abgewichen werden muss. Deren Konfigurationsdatei ist nach dem Muster <code>etc/systemd/journald@NAMENSRAUM.conf</code> zu erstellen.<br />
Einem bestimmten Journal-Namensraum k&ouml;nnen Dienste-Units mittels der Unit-Dateieinstellung <code>LogNamespace=</code> zugeordnet werden.</p>
<p>Standardm&auml;&szlig;ig sammelt nur der Vorgabe-Namensraum Kernel- und Auditprotokollnachrichten.</p>
<p><strong>Rangfolge</strong></p>
<p>Wenn Pakete die Konfiguration anpassen m&uuml;ssen, k&ouml;nnen sie Konfigurationsschnipsel in <code>/usr/lib/systemd/*.conf.d/</code> oder <code>/usr/local/lib/systemd/*.conf.d/</code> installieren.</p>
<p>Die Hauptkonfigurationsdatei wird vor jeder anderen aus den Konfigurationsverzeichnissen gelesen und hat die niedrigste Priorit&auml;t. Eintr&auml;ge in einer Datei in jedem der Konfigurationsverzeichnisse setzen Eintr&auml;ge in der Hauptkonfigurationsdatei au&szlig;er Kraft. Dateien in den Unterverzeichnissen <code>*.conf.d/</code> werden nach ihrem Dateinamen sortiert, unabh&auml;ngig davon, in welchem Unterverzeichnis sie sich befinden. Sofern eigene Konfigurationsdateien n&ouml;tig sind, wird empfohlen, allen Dateinamen in diesen Unterverzeichnissen eine zweistellige Zahl und einen Bindestrich voranzustellen, um die Sortierung der Dateien zu vereinfachen.</p>
<h3 id="journalctl">journalctl</h3>
<p><em>journalctl</em> dient der Abfrage des von systemd-journald erstellten Journals.<br />
Beim Aufruf ohne Parameter wird der gesamte Inhalt aus allen zugreifbaren Quellen des Journals angezeigt, beginnend mit dem &auml;ltesten Eintrag.<br />
Die Ausgabe wird seitenweise durch <em>less</em> geleitet. Lange Zeilen kann man mittels der <strong><code>Pfeil-links</code></strong> und <strong><code>Pfeil-rechts</code></strong> Tasten betrachten. Die Option <code>--no-pager</code> deaktiviert die seitenweise Anzeige, wobei die Zeilen auf die Breite des Terminals verk&uuml;rzt werden.</p>
<p><em>journalctl</em> bietet zu den nachfolgend beschriebenen Optionen eine ganze Reihe weiterer M&ouml;glichkeiten der Filterung und Aufbereitung der Ausgaben. Bitte auch die man-Page <a href="https://manpages.debian.org/testing/manpages-de/journalctl.1.de.html">journalctl, Journalabfrage</a> lesen.</p>
<p><strong>Rechte</strong></p>
<p>Dem Benutzer <strong>root</strong> und allen Benutzern die Mitglied der Gruppen <strong>systemd-journal</strong>, <strong>adm</strong> und <strong>wheel</strong> sind, wird Zugriff auf das System-Journal und die Journale der anderen Benutzer gew&auml;hrt. Siduction f&uuml;gt alle konfigurierten USER der Gruppe <strong>systemd-journal</strong> zu.</p>
<p>Das Journal enth&auml;lt vertrauensw&uuml;rdige Felder, d.h. Felder, die implizit vom Journal hinzugef&uuml;gt werden und durch Client-Code nicht ge&auml;ndert werden k&ouml;nnen. Sie beginnen mit einem Unterstrich. (z.B.: _PID=, _UID=, _GID=, _COMM=, _EXE=, _CMDLINE= )</p>
<p><strong>Ausgabe filtern</strong></p>
<ul>
<li><p><em>Optionen</em>: <code>--user</code>, <code>--system</code>, <code>--directory=</code>, <code>--file=</code>, <code>--namespace=</code><br />
Die Optionen begrenzen die Quelle der Ausgabe auf den genannten Bereich, das Verzeichnis oder die Datei.</p></li>
<li><p><em>Optionen</em>: <code>-b</code>, <code>-k</code>, <code>-u</code>, <code>-p</code>, <code>-g</code>, <code>-S</code>, <code>-U</code><br />
Die Ausgaben dieser Optionen verwenden alle zu Verf&uuml;gung stehenden Journal-Dateien, es sei denn, eine der zuvor genannten Optionen wird zus&auml;tzlich verwendet.</p>
<ul>
<li><p><code>-b</code> <code>--boot=</code><br />
Zeigt Nachrichten von einem bestimmten Systemstart. Ohne Argument werden die Protokolle f&uuml;r den aktuellen Systemstart angezeigt. Das Argument “-1” gibt die Meldungen des Systemstarts vor dem Aktuellen aus. Das Argument “5” pr&auml;sentiert die Meldungen des f&uuml;nften Systemstarts seit Beginn der Aufzeichnungen.</p></li>
<li><p><code>-k</code> <code>--dmesg</code><br />
Zeigt nur Kernelnachrichten. Dies beinhaltet die Option <code>-b</code>, sodass nur Kernelmeldungen seit dem aktuellen Systemstart ausgegeben werden.</p></li>
<li><p><code>-u</code> <code>--unit=</code><br />
Diese Option ben&ouml;tigt die Angabe einer UNIT oder eines MUSTERs.<br />
Gibt die Journaleintr&auml;ge f&uuml;r die angegebene systemd-Unit UNIT oder f&uuml;r alle Units, die auf das MUSTER passen, aus.</p></li>
<li><p><code>-p</code> <code>--priority=</code><br />
Filtert die Ausgabe nach Nachrichtenpriorit&auml;ten oder Priorit&auml;tsbereichen. Ben&ouml;tigt die Angabe einer einzelnen Protokollstufe, oder einen Bereich von Protokollstufen in der Form VON..BIS.<br />
Die Protokollstufen sind die normalen Syslog-Protokollstufen:<br />
“emerg” (0), “alert” (1), “crit” (2), “err” (3), “warning” (4), “notice” (5), “info” (6), “debug” (7)<br />
Als Argument k&ouml;nnen sowohl die Namen als auch die Ziffern der Protokollstufen verwendet werden. Falls eine einzelne Protokollstufe angegeben ist, werden alle Nachrichten mit dieser oder einer niedrigeren Protokollstufe angezeigt.</p></li>
<li><p><code>-g</code> <code>--grep=</code><br />
Ben&ouml;tigt die Angabe eines PERL-kompatiblen regul&auml;ren Ausdrucks, um die Ausgabe zu filtern. Der regul&auml;re Ausdruck wird in den Journaleintr&auml;gen auf das Feld “MESSAGE=” angewendet.</p></li>
<li><p><code>-S</code> <code>--since=</code> und <code>-U</code> <code>--until=</code><br />
Die Anzeige beginnt mit neueren Eintr&auml;gen ab dem angegebenen Datum oder &auml;lteren Eintr&auml;gen bis zum angegebenen Datum. Das Datumsformat sollte “2012-10-30 18:17:16” sein, es k&ouml;nnen aber auch Teile davon weggelassen werden. Alternativ sind die Zeichenketten “yesterday”, “today”, “tomorrow” m&ouml;glich. Das Argument “now” bezieht sich auf die aktuelle Zeit. Die Angabe relativer Zeiten erm&ouml;glichen ein vorangestelltes “-” oder “+”, die sich auf Zeiten vor bzw. nach der angegebenen Zeit beziehen.</p></li>
</ul></li>
</ul>
<p><strong>Ausgabe steuern</strong></p>
<ul>
<li><p>Optionen: <code>-f</code>, <code>-n</code>, <code>-r</code>, <code>-o</code>, <code>-x</code>, <code>--no-pager</code></p>
<ul>
<li><p><code>-f</code> <code>--follow</code><br />
Nur die neusten Journal-Eintr&auml;ge anzeigen und kontinuierlich neue Eintr&auml;ge ausgeben. Dies beinhaltet die Option <code>-n</code>. Die Ausgabe ist vergleichbar mit dem altbekannten Befehl <code>tail -f /var/log/messages</code>.</p></li>
<li><p><code>-n</code> <code>--lines=</code><br />
Zeigt die neusten Journal-Eintr&auml;ge und begrenzt die Anzahl der zu zeigenden Ereignisse. Das Argument ist eine positive Ganzzahl. Der Vorgabewert ist 10, falls kein Argument angegeben wird.</p></li>
<li><p><code>-r</code> <code>--reverse</code><br />
Die Ausgabe beginnt mit dem neusten Eintrag.</p></li>
<li><p><code>-o</code> <code>--output=</code><br />
Steuert die Formatierung der angezeigten Journal-Eintr&auml;ge. Dieser Option sind eine ganze Reihe weiterer Optionen untergeordnet, von denen wir hier nur die Option “short-full” betrachten.</p>
<p><code>-o short-full</code><br />
Die Ausgabe ist gr&ouml;&szlig;tenteils identisch zu der Formatierung klassischer Syslog-Dateien. Sie zeigt eine Zeile pro Journal-Eintrag an, aber der Zeitstempel wird im Format, das die Optionen –since= und –until= akzeptieren, ausgegeben. Deshalb eignet sich diese Ausgabe sehr gut um nachfolgend eine zeitbezogene Filterung der Journaleintr&auml;ge zu erstellen.</p></li>
<li><p><code>-x</code> - -catalog<br />
Erg&auml;nzt Protokollzeilen mit erkl&auml;renden Hilfetexten, soweit diese verf&uuml;gbar sind.</p></li>
<li><p><code>--no-pager</code><br />
Die Option deaktiviert die seitenweise Anzeige, wobei die Zeilen auf die Breite des Terminals verk&uuml;rzt werden. Sie zu benutzen ist nur sinnvoll, wenn f&uuml;r die Ausgabe nur eine geringe Anzahl an Zeilen erwartet wird.</p></li>
</ul></li>
</ul>
<p><strong>journalctl steuern</strong></p>
<ul>
<li><p>Optionen: <code>--disk-usage</code>, <code>--vacuum-size=</code>, <code>--vacuum-time=</code>, <code>--vacuum-files</code>, <code>--rotate</code>, <code>--verify</code><br />
Die Optionen behandeln die Verwaltung der von <em>journald</em> geschriebenen Daten.</p>
<ul>
<li><p><code>--disk-usage</code><br />
Zeigt den aktuellen Plattenplatzverbrauch aller Journal-Dateien an.</p></li>
<li><p><code>--vacuum-size=</code>, <code>--vacuum-time=</code>, <code>--vacuum-files</code><br />
Entfernt die &auml;ltesten archivierten Journal-Dateien, bis der Plattenplatz, den sie verwenden, unter die angegebene Gr&ouml;&szlig;e f&auml;llt oder alle archivierten Journal-Dateien, die keine Daten &auml;lter als die angegebene Zeitspanne enthalten oder so dass nicht mehr als die angegebene Anzahl an separaten Journal-Dateien verbleiben. Die Ausf&uuml;hrung von <code>--vacuum-xxx</code> bezieht nicht die aktiven Journal-Dateien ein.</p></li>
<li><p><code>--rotate</code><br />
Bittet den Journal-Daemon, die Journal-Dateien zu rotieren. Journal-Dateien-Rotation hat den Effekt, dass alle derzeit aktiven Journal-Dateien als archiviert markiert und umbenannt werden, so dass in der Zukunft niemals mehr in sie geschrieben wird. Dann werden stattdessen neue (leere) Journal-Dateien erstellt. Diese Aktion kann mit <code>--vacuum-xxx</code> in einem einzigen Befehl kombiniert werden, um die <code>--vacuum-xxx</code> mitgegebenen Argumente tats&auml;chlich zu erreichen.</p></li>
<li><p><code>--verify</code><br />
Pr&uuml;ft die Journal-Dateien auf interne Konsistenz.</p></li>
</ul></li>
</ul>
<h3 id="journalctl-beherrschen">journalctl beherrschen</h3>
<p>Wie oben unter Rechte beschrieben, kannst Du das Journal als einfacher User benutzen. Hier sind einige Beispiele:</p>
<table>
<colgroup>
<col style="width: 37%" />
<col style="width: 62%" />
</colgroup>
<thead>
<tr class="header">
<th>Befehl</th>
<th>Anzeige</th>
</tr>
</thead>
<tbody>
<tr class="odd">
<td>journalctl</td>
<td>das volle Journal aller User, &auml;lteste Eintr&auml;ge zuerst</td>
</tr>
<tr class="even">
<td>journalctl -r</td>
<td>wie zuvor, neueste Eintr&auml;ge zuerst</td>
</tr>
<tr class="odd">
<td>journalctl -b</td>
<td>das Protokoll des letzten Bootvorgangs</td>
</tr>
<tr class="even">
<td>journalctl -b -1 -k</td>
<td>vom vorletzten Bootvorgang (-1) alle Kernelmeldungen</td>
</tr>
<tr class="odd">
<td>journalctl -b -p err</td>
<td>limitiert auf den letzten Boot und die Priorit&auml;t ERROR</td>
</tr>
<tr class="even">
<td>journalctl –since=yesterday</td>
<td>das Journal seit gestern</td>
</tr>
<tr class="odd">
<td>journalctl /dev/sda</td>
<td>das Journal der Ger&auml;tedatei /dev/sda</td>
</tr>
<tr class="even">
<td>journalctl /usr/bin/dbus-daemon</td>
<td>alle Logs des D-Bus-Daemon</td>
</tr>
<tr class="odd">
<td>journalctl -f</td>
<td>Liveansicht des Journal (fr&uuml;her: tail -f /var/log/messages)</td>
</tr>
</tbody>
</table>
<p>Die Option "`–list-boots*" gibt die entsprechende Liste aus.</p>
<pre><code># journalctl --list-boots --no-pager
[...]
 -50 8fc07f387... Sun 2021-02-28 11:07:05 CET-Sun [...] CET
 -49 aa49cb3af... Mon 2021-03-01 17:49:58 CET-Mon [...] CET
 -48 3a6e55a4a... Tue 2021-03-02 12:18:46 CET-Tue [...] CET
 -47 a46150a19... Wed 2021-03-03 11:06:29 CET-Wed [...] CET
 -46 d42ed8b05... Thu 2021-03-04 10:59:56 CET-Thu [...] CET
 -45 566f65991... Thu 2021-03-04 19:53:52 CET-Thu [...] CET
 -44 8e2da4a61... Fri 2021-03-05 10:15:18 CET-Fri [...] CET
[...]</code></pre>
<p>Anschlie&szlig;end kannst du dir mit dem Befehl <strong><code>journalctl -b -47</code></strong> die Meldungen des Bootvorgangs vom 3.3.2021 anzeigen lassen.</p>
<p>Eine weitere Neuerung beim Protokollieren ist die Tab-Vervollst&auml;ndigung f&uuml;r journalctl. Wenn Du <em>journalctl</em> schreibst, und zwei mal die <strong><code>TAB</code></strong> Taste dr&uuml;ckst, erscheint eine Liste m&ouml;glicher Vervollst&auml;ndigungen:</p>
<pre><code>$ journalctl
_AUDIT_FIELD_APPARMOR=        _KERNEL_SUBSYSTEM=
_AUDIT_FIELD_CAPABILITY=      KERNEL_USEC=
_AUDIT_FIELD_CAPNAME=         LEADER=
_AUDIT_FIELD_DENIED_MASK=     LIMIT=
_AUDIT_FIELD_INFO=            LIMIT_PRETTY=
_AUDIT_FIELD_NAME=            _LINE_BREAK=
_AUDIT_FIELD_OPERATION=       _MACHINE_ID=
_AUDIT_FIELD_OUID=            MAX_USE=
_AUDIT_FIELD_PEER=            MAX_USE_PRETTY=
_AUDIT_FIELD_PROFILE=         MESSAGE=
_AUDIT_FIELD_REQUESTED_MASK=  MESSAGE_ID=
_AUDIT_FIELD_SIGNAL=          NM_CONNECTION=
_AUDIT_ID=                    NM_DEVICE=
_AUDIT_LOGINUID=              NM_LOG_DOMAINS=
_AUDIT_SESSION=               NM_LOG_LEVEL=
_AUDIT_TYPE=                  N_RESTARTS=
_AUDIT_TYPE_NAME=             _PID=
AVAILABLE=                    PRIORITY=
AVAILABLE_PRETTY=             SEAT_ID=
_BOOT_ID=                     _SELINUX_CONTEXT=
_CAP_EFFECTIVE=               SESSION_ID=
_CMDLINE=                     SHUTDOWN=
CODE_FILE=                    SLEEP=
CODE_FUNC=                    _SOURCE_MONOTONIC_TIMESTAMP=
CODE_LINE=                    _SOURCE_REALTIME_TIMESTAMP=
_COMM=                        _STREAM_ID=
COMMAND=                      SYSLOG_FACILITY=
CONFIG_FILE=                  SYSLOG_IDENTIFIER=
CONFIG_LINE=                  SYSLOG_PID=
CURRENT_USE=                  SYSLOG_RAW=
CURRENT_USE_PRETTY=           SYSLOG_TIMESTAMP=
DISK_AVAILABLE=               _SYSTEMD_CGROUP=
DISK_AVAILABLE_PRETTY=        _SYSTEMD_INVOCATION_ID=
DISK_KEEP_FREE=               _SYSTEMD_OWNER_UID=
DISK_KEEP_FREE_PRETTY=        _SYSTEMD_SESSION=
ERRNO=                        _SYSTEMD_SLICE=
_EXE=                         _SYSTEMD_UNIT=
EXECUTABLE=                   _SYSTEMD_USER_SLICE=
EXIT_CODE=                    _SYSTEMD_USER_UNIT=
EXIT_STATUS=                  THREAD_ID=
_FSUID=                       TIMESTAMP_BOOTTIME=
_GID=                         TIMESTAMP_MONOTONIC=
GLIB_DOMAIN=                  _TRANSPORT=
GLIB_OLD_LOG_API=             _UDEV_DEVNODE=
_HOSTNAME=                    _UDEV_SYSNAME=
INVOCATION_ID=                _UID=
JOB_ID=                       UNIT=
JOB_RESULT=                   UNIT_RESULT=
JOB_TYPE=                     USER_ID=
JOURNAL_NAME=                 USER_INVOCATION_ID=
JOURNAL_PATH=                 USERSPACE_USEC=
_KERNEL_DEVICE=               USER_UNIT=</code></pre>
<p>Die meisten davon sind selbsterkl&auml;rend. Beispielsweise COMM, was f&uuml;r <em>command</em> steht, bedient eine Menge an Optionen:</p>
<p><strong><code>journalctl _COMM=</code></strong> listet nach einem weiterer Druck auf TAB die m&ouml;glichen Applikationen:</p>
<pre><code>$ journalctl _COMM=
acpid           hddtemp        ntpdate       systemd
acpi-fakekey    hdparm         ntpd          systemd-fsck
acpi-support    hp             ofono         systemd-hostnam
alsactl         hpfax          ofonod        systemd-journal
anacron         ifup           pkexec        systemd-logind
apache2         irqbalance     polkitd       systemd-modules
backlighthelper kbd            pulseaudio    systemd-shutdow
bash            kdm            pywwetha      systemd-udevd
bluetoothd      keyboard-setup pywwetha.py   teamviewerd
chfn            loadcpufreq    resolvconf    udev-configure-
chrome          logger         rpcbind       udisksd
console-kit-dae login          rpc.statd     udisks-daemon
console-setup   lvm            samba-ad-dc   umount
cpufrequtils    lvm2           saned         uptimed
cron            mbd            sensors       useradd
cups            mbmon          sh            usermod
dbus-daemon     mdadm          smartmontools vboxdrv
ddclient        mdadm-raid     smbd          VBoxExtPackHelp
docvert-convert mtp-probe      ssh           vdr
glances         mysql          sshd          winbind
gpasswd         networking     su
gpm             nfs-common     sudo
groupadd        ntp            sysstat</code></pre>
<p>Mit <strong><code>journalctl _COMM=su</code></strong> kannst du nun sehen, welcher User sich wann mit “su” root-Rechte verschafft hat.</p>
<pre><code># journalctl _COMM=su
-- boot 1b5d2b3fcd9043d88d8abce665b75ed4 --
Mar 10 16:27:22 pc1 su[105197]: (to root) siduser on pts/1
Mar 10 16:27:22 pc1 su[105197]: pam_unix(su:session):
     session opened for user root(uid=0) by (uid=1000)
Mar 10 17:54:33 pc1 su[105197]: pam_unix(su:session):
     session closed for user root
     
-- boot 37b19f6321814620be1ed4deb3be467f --
Mar 10 17:56:35 pc1 su[3381]: (to root) siduser on pts/1
Mar 10 17:56:35 pc1 su[3381]: pam_unix(su:session):
     session opened for user root(uid=0) by (uid=1000)
Mar 10 19:07:17 pc1 su[3381]: pam_unix(su:session):
     session closed for user root</code></pre>
<p>Ein anderes Beispiel:<br />
Man kann die Ausgabe zus&auml;tzlich zeitlich eingrenzen.</p>
<pre><code># journalctl _COMM=dbus-daemon --since=2020-04-06 --until=&quot;2020-04-07 23:40:00&quot;
[...]
Apr 07 22:59:04 pc1 org.gtk.Private.GPhoto2VolumeMonitor[2006]: ### debug: in handle_supported
Apr 07 22:59:04 pc1 org.gtk.Private.GPhoto2VolumeMonitor[2006]: ### debug: in handle_list
Apr 07 22:59:04 pc1 org.gtk.Private.GoaVolumeMonitor[2006]: ### debug: in handle_supported
Apr 07 22:59:04 pc1 org.gtk.Private.GoaVolumeMonitor[2006]: ### debug: in handle_list
Apr 07 23:03:09 pc1 org.gtk.Private.GPhoto2VolumeMonitor[2006]: ### debug: Name owner &#39;:1.4320&#39; vanished
Apr 07 23:03:09 pc1 org.gtk.Private.GoaVolumeMonitor[2006]: ### debug: Name owner &#39;:1.4320&#39; vanished
Apr 07 23:03:09 pc1 org.gtk.Private.AfcVolumeMonitor[2006]: ### debug: Name owner &#39;:1.4320&#39; vanished
Apr 07 23:03:09 pc1 org.gtk.Private.MTPVolumeMonitor[2006]: ### debug: Name owner &#39;:1.4320&#39; vanished</code></pre>
<p>Viele der oben genannten Optionen lassen sich miteinander kombinieren, damit nur die gesuchten Journaleintr&auml;ge angezeigt werden. Die man-page von <a href="https://manpages.debian.org/testing/manpages-de/journalctl.1.de.html">journalctl</a> beschreibt alle Optionen ausf&uuml;hrlich.</p>
<h3 id="quellen-journald">Quellen journald</h3>
<p><a href="https://manpages.debian.org/testing/manpages-de/systemd-journald.8.de.html">systemd-journald</a><br />
<a href="https://manpages.debian.org/testing/manpages-de/journald.conf.5.de.html">journald Konfiguration</a><br />
<a href="https://manpages.debian.org/testing/manpages-de/journalctl.1.de.html">journalctl, Journalabfrage</a><br />
<a href="https://manpages.debian.org/testing/manpages-de/systemd-journal-gatewayd.8.de.html">journal gatewayd</a><br />
<a href="https://manpages.debian.org/testing/manpages-de/systemd-journal-remote.8.de.html">journal remote</a><br />
<a href="https://manpages.debian.org/testing/manpages-de/systemd-journal-upload.8.de.html">journal upload</a><br />
<a href="https://manpages.debian.org/testing/manpages-de/systemd-cat.1.de.html">systemd-cat.1.de</a></p>
<p>Dank an Helge Kreuzmann f&uuml;r die deutschen &Uuml;bersetzungen.</p>
<div id="rev">
Seite zuletzt aktualisiert 2021-11-29
</div>
</body>
</html>
