<!DOCTYPE html>
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="de" lang="de">
<head>
<meta http-equiv="content-type" content="text/html; charset=UTF-8">
<meta charset="utf-8">
<meta name="generator" content="pandoc">
<meta name="viewport" content="width=device-width, initial-scale=1.0, user-scalable=yes">
<title>Terminal - Kommandozeile</title>
<style>
body            {font-family: Verdana, sans-serif; margin: 0 auto; float: none; max-width: 55em; padding: 4%; color: black;}
p, li           {line-height: 1.5;}
p img           {width: 1.5em; height: auto; border: 0.1em solid #CCC;}
p code, li code {display: inline; color: #000; padding: 0.1em; font-size: 1.2em;}
p.warning       {display: block; line-height: 1.3em; padding: 0.4em; background: #FFDDDD; border: 0.15em solid #C33; border-radius: 0.5em;}
p.warning code  {background: #FFDDDD; border: none;}
code            {display: block; max-width: 100%; background-color: #EEE; padding: 0.3em; border: #CCC thin solid; border-radius: 3px; font-size: 1.2em;}
pre             {color: #000; padding: 0.3em;}
pre code        {display: block; overflow:auto; max-width: 100%; color: #000; padding-bottom: 0.8em;}
li pre code     {padding: 0.3em 0.3em 0.8em 0.3em;}
table, th, td   {background-color: #EED; border: #CCC thin solid; border-collapse: collapse; padding: 0.15em;}
hr              {height: 0.2em; background-color: #CCC; border: 0; margin: 2em 0 2em 0;}
figcaption      {font-size: 0.8em; color: #888;}
figure img      {max-width: 85%; height: auto; border: 0.1em solid #CCC;}
a               {color: black; text-decoration: underline;}
a:visited       {color: #FF6600;}
a:hover         {color: #FFF; background-color: #FF6600; transition: all .25s ease-in;}
#rev            {float:right; font-size: 0.8em; color: #888;}
</style>
</head>
<body>
<header id="title-block-header">
<h1 class="title">Terminal - Kommandozeile</h1>
</header>
<nav id="TOC" role="doc-toc">
<ul>
<li><a href="#terminal---kommandozeile">Terminal - Kommandozeile</a>
<ul>
<li><a href="#arbeit-als-root">Arbeit als root</a></li>
<li><a href="#farbiges-terminal">Farbiges Terminal</a></li>
<li><a href="#wenn-das-terminal-h&auml;ngt">Wenn das Terminal h&auml;ngt</a></li>
<li><a href="#hilfe-im-terminal">Hilfe im Terminal</a></li>
<li><a href="#linux-konsolenbefehle">Linux Konsolenbefehle</a></li>
<li><a href="#skripte-benutzen">Skripte benutzen</a></li>
</ul></li>
</ul>
</nav>
<h2 id="terminal---kommandozeile">Terminal - Kommandozeile</h2>
<p>Ein Terminal, auch Konsole genannt, ist ein Programm, das es einem erm&ouml;glicht, durch direkt ausgef&uuml;hrte Befehle unmittelbar mit dem GNU/Linux Betriebssystem zu interagieren. Das Terminal, auch h&auml;ufig die <em>“Shell”</em> oder <em>“Kommandozeile”</em> genannt, ist ein &auml;u&szlig;erst m&auml;chtiges Werkzeug und den Aufwand wert, die Grundlagen seiner Handhabung zu erlernen.</p>
<p>In siduction kann man das Terminal/die Konsole aufrufen, indem man das PC-Monitorsymbol rechts des Men&uuml;s anklickt oder im <em>Men&uuml;</em> &gt; <em>System</em> &gt; <em>Terminal</em> aufruft, oder, noch einfacher, in die Suchleiste des Men&uuml; <em>“kons”</em> oder <em>“term”</em> eintippt.</p>
<p>Nach dem Aufrufen des Terminals sieht man die Eingabeaufforderung “prompt”:</p>
<pre><code>username@hostname:~$</code></pre>
<p><em>“username”</em> in obigem Beispiel entspricht dem Nutzernamen des angemeldeten Benutzers. Die Tilde <code>~</code> zeigt, man befindet sich in seinem Heimverzeichnis <code>/home/username</code> , und das Dollarzeichen (der Promt) <code>$</code> bedeutet, dass man im Terminal mit eingeschr&auml;nkten Benutzerrechten angemeldet ist. Am Ende blinkt der Cursor. Dies alles ist die Kommandozeile. Hier werden Befehle eingegeben, die das Terminal ausf&uuml;hren soll.</p>
<p>Viele Befehle kann man nur mit root-Rechten, also Administratorrechten, ausf&uuml;hren. Root-Rechte erh&auml;lt man, indem man <code>su</code> eingibt und <code>Enter</code> dr&uuml;ckt. Hiernach muss man das Rootpasswort eingeben. Das Passwort wird w&auml;hrend der Eingabe auf dem Bildschirm nicht angezeigt. (Siehe unten <a target="_blank" href="https://manual.siduction.org/term-konsole_de.html#arbeit-als-root">Arbeit als root</a>)</p>
<p>Ist die Eingabe korrekt, zeigt die Kommandozeile nun:</p>
<pre><code>root@hostname:/home/username#</code></pre>
<p>Zu beachten ist, dass das Dollarzeichen <code>$</code> durch eine Raute <code>#</code> ersetzt wurde. In einem Terminal bedeutet die Raute immer, dass man mit <strong>root</strong>-Rechten angemeldet ist.<br />
Wenn im Handbuch Kommandozeilenbefehle angegeben werden, werden die Angaben vor dem Prompt ($ oder #) ausgelassen. Ein Befehl wie:</p>
<pre><code># chmod g+w &lt;Datei&gt;</code></pre>
<p>bedeutet also: man &ouml;ffnet ein Terminal, meldet sich als <strong>root</strong> an ( <code>su</code> ) und f&uuml;hrt dann den Befehl an einem Rootprompt <code>#</code> aus. Die Raute wird nicht mit eingegeben.</p>
<p>Ein weiterer Hinweis:<br />
F&uuml;r User, die neu am Terminal arbeiten, ist es oft verwirrend, wenn nach dem Ausf&uuml;hren eines Befehls keine Meldung erscheint, sondern nur wieder der leere Prompt. Diese Funktion ist gewollt und bedeutet, dass der Befehl fehlerfrei ausgef&uuml;hrt wurde. (Im obigen Beispiel erhielten die Gruppenmitglieder Schreibrechte an der &lt;Datei&gt;.)</p>
<h3 id="arbeit-als-root">Arbeit als root</h3>
<p class="warning">
<strong>Achtung:</strong> <br />W&auml;hrend man mit root-Rechten im Terminal eingeloggt ist, darf man alles, z. B. Dateien l&ouml;schen, ohne die das Betriebssystem nicht mehr funktioniert, uvm. Wenn man mit root-Rechten arbeitet, muss man sich dar&uuml;ber im Klaren sein, <em>was</em> man gerade macht, denn es ist leicht m&ouml;glich, dem Betriebssystem irreparable Sch&auml;den zuzuf&uuml;gen.
</p>
<p>Ber&uuml;cksichtigen muss man, dass alle Aktionen, soweit im Programm vorgesehen, auch mit root-Rechten ausgef&uuml;hrt werden. Der einfache copy-Befehl <strong><code>cp &lt;Quelle&gt; &lt;Ziel&gt;</code></strong> in einem User-Verzeichnis f&uuml;hrt zu Dateien mit dem Eigent&uuml;mer <strong>root</strong> im Zielverzeichnis. Das ist vermutlich nicht gewollt und auch nicht sinnvoll.</p>
<p>Deshalb: <strong>Arbeiten als Root nur dort, wo es wirklich notwendig ist!</strong></p>
<p><strong>&Uuml;ber su</strong></p>
<p>Eine Anzahl von Befehlen muss mit root-Rechten gestartet werden. Diese Rechte erh&auml;lt man durch Eingabe von <strong><code>su</code></strong>. Nach der Eingabe des richtigen Passwortes erscheint der Root-Prompt.</p>
<pre><code>$ su
Passwort: 
#</code></pre>
<p>Jetzt ist es m&ouml;glich im Terminal alle Befehle auszuf&uuml;hren und alle Programme zu starten, die root-Rechte erfordern. Beenden kann man diesen Status mit der Eingabe von</p>
<pre><code># exit
$</code></pre>
<p>und es erscheint wieder der Promt f&uuml;r den User.</p>
<p><strong>&Uuml;ber su-to-root</strong></p>
<p>Im Gegensatz zum allgemeinen Befehl <em>“su”</em> erlaubt <em>“su-to-root”</em> das Ausf&uuml;hren von Programmen mit graphischer Oberfl&auml;che mit root-Rechten. <em>“su-to-root”</em> transferiert unter Benutzung von <em>“su”</em> die X-Eigenschaften an den Zielnutzer. Die Eingabe lautet:</p>
<pre><code>su-to-root -X -c &lt;Programm&gt;</code></pre>
<p>Wenn Fehlermeldungen mit Bezug zu <em>“dbus”</em> auftreten, ist die Eingabe zu erweitern:</p>
<pre><code>su-to-root -X -c &#39;dbus-launch &lt;Programm&gt;&#39;</code></pre>
<p>Es &ouml;ffnet sich ein weiteres Terminal, in das das root-Passwort einzugeben ist. Bei Erfolg startet das gew&uuml;nschte Programm mit root-Rechten.<br />
Beispiele f&uuml;r die Verwendung graphischer Anwendungen mittels <em>“su-to-root”</em> sind: Die Bearbeitung einer Konfigurationsdatei mit einem Texteditor, der Einsatz des Partitionierungsmanagers gparted oder die Verwendung von Dateimanagern wie dolphin oder thunar.</p>
<p><strong>Verwendung in den Desktopumgebungen:</strong></p>
<ul>
<li>Plasma (KDE und LXQt)<br />
Der Befehl ist in Plasma nicht notwendig und wird nicht unterst&uuml;tzt, denn f&uuml;r Programme, die root-Rechte ben&ouml;tigen erfolgt eine Passwortabfrage und beim Editor erfolgt die Abfrage wenn man die ge&auml;nderte Datei speichern m&ouml;chte. Deshalb nur <code>su</code> im Terminal verwenden, wenn n&ouml;tig.</li>
<li>Gnome und Cinnamon<br />
Das Verhalten ist dem in Plasma &auml;hnlich, mit der Ausnahme, dass der Befehl (su-to-root) unterst&uuml;tzt wird, aber nicht notwendig ist.</li>
<li>XFCE und Xorg<br />
Hier entfaltet der Befehl seine volle Macht, und man ist in der Lage das gew&uuml;nschte graphische Programm mit root-Rechten zu starten. Mann ist jedoch auch in der Pflicht zu beachten, wann und mit welchem Programm root-Rechte wirklich erforderlich sind.</li>
</ul>
<p class="warning">
Unter keinen Umst&auml;nden sollten Produktivprogramme, die normalerweise mit Benutzerrechten gestartet werden, mit dieser Option als root hochgefahren werden: Internet-Browser, E-Mail-Programme, B&uuml;roprogramme u.a.
</p>
<p><strong>sudo ist nicht konfiguriert</strong></p>
<p>Sudo steht nur im Live-Modus zur Verf&uuml;gung, da im Live-Modus kein Root-Passwort gesetzt ist.<br />
<strong>Nach einer Installation ist sudo nicht aktiviert</strong>. Der Grund ist: Sollte ein Angreifer das Nutzer-Passwort abgreifen, erlangt er noch keine Super-User-Rechte und kann keine sch&auml;dlichen Ver&auml;nderungen am System durchf&uuml;hren.<br />
Ein anderes Problem mit sudo ist, dass eine Root-Anwendung, die mit der Nutzerkonfiguration l&auml;uft, Berechtigungen &auml;ndern und somit f&uuml;r den Nutzer unbrauchbar machen kann. Die Verwendung von <code>su</code> oder <code>su-to-root</code> wird empfohlen!<br />
Sollte man trotz aller Warnungen sudo nutzen wollen, so muss man den entsprechenden $user der Gruppe sudo hinzuf&uuml;gen!<br />
Dies kann mit dem Befehl <strong><code>adduser BENUTZER GRUPPE</code></strong> als <strong>root</strong> ausgef&uuml;hrt werden.</p>
<p>Als schlanke Alternative zu <em>“sudo”</em> empfehlen wir <code>doas</code>. Die Handbuchseite <a target="_blank" href="https://manual.siduction.org/sys-admin-doas_de.html#doas---alternative-zu-sudo">Doas - Alternative zu Sudo</a> erl&auml;utert die Vorteile von Doas und die Doas Konfiguration.</p>
<h3 id="farbiges-terminal">Farbiges Terminal</h3>
<p>Farbige Prompts am Terminal k&ouml;nnen einen vor unangenehmen oder katastrophalen Fehlern bewahren, falls man als <strong>root</strong> eine Aufgabe durchf&uuml;hrt, die man als <strong>user</strong> machen wollte.<br />
Deshalb ist in siduction in der Grundeinstellung der Prompt des user gr&uuml;n, blau und wei&szlig;, und bei dem von root wird das Wort “root” in roter Farbe dargestellt.</p>
<figure>
<img src="./images-de/terminal/prompt-colour-01.png" alt="" /><figcaption>Farbiger Prompt</figcaption>
</figure>
<p>Der Fokus beim Arbeiten mit dem Terminal sollte auf den Eingaben und Ausgaben der Befehle liegen und nicht auf bunte Prompts. In siduction haben wir uns trotzdem f&uuml;r die Farben entschieden, um den Usern einen Warnhinweis zu geben, wenn sie als Systemadministrator mit root-Rechten unterwegs sind.</p>
<p><strong>Farbe des Prompts &auml;ndern</strong></p>
<p>Bevor die Konfigurationsdatei ge&auml;ndert wird, erstellen wir im Terminal erst eine Sicherungskopie mit einem Datumsstempel.</p>
<pre><code>$ cp ~/.bashrc ~/.bashrc_$(date +%F)</code></pre>
<p>Dann &ouml;ffnen wir mit einem Texteditor unserer Wahl (z. B.: kate, gedit, mcedit, vim…) die Datei <code>~/.bashrc</code> und suchen nach folgender Zeile, die sich etwa in der Mitte der Datei befindet:</p>
<pre><code>PS1=&#39;${debian_chroot:+($debian_chroot)}\[\033[01;32m\]\u@\h\[\033[00m\]:\[\033[01;34m\]\w\[\033[00m\]\$ &#39;</code></pre>
<p>Dem Schrift- und Farbcode folgen unmittelbar die Promtteile, die diese Darstellung erhalten sollen. In der folgenden Abbildung wird der Bezug zwischen den Promtteilen und ihren K&uuml;rzeln gezeigt.</p>
<figure>
<img src="./images-de/terminal/prompt-colour-02.png" alt="" /><figcaption>Prompt Code</figcaption>
</figure>
<p>Die anschlie&szlig;ende Tabelle erkl&auml;rt die Werte der Syntax “[\033[<strong>01;32</strong>m]”, wobei der fett gedruckte Teil die Schriftattribute und die Farbe bestimmt.</p>
<table>
<thead>
<tr class="header">
<th>Schriftcode</th>
<th>Schriftattribut</th>
<th>Farbcode</th>
<th>Farbe</th>
</tr>
</thead>
<tbody>
<tr class="odd">
<td>00m</td>
<td>Standard f&uuml;r Schrift und Farbe</td>
<td></td>
<td></td>
</tr>
<tr class="even">
<td>00;XX</td>
<td>Standardschrift</td>
<td>XX;m</td>
<td>Standardfarbe</td>
</tr>
<tr class="odd">
<td>01;XX</td>
<td>fett</td>
<td>XX;30</td>
<td>schwarz</td>
</tr>
<tr class="even">
<td>02;XX</td>
<td>dunkel</td>
<td>XX;31</td>
<td>rot</td>
</tr>
<tr class="odd">
<td>03;XX</td>
<td>kursiv</td>
<td>XX;32</td>
<td>gr&uuml;n</td>
</tr>
<tr class="even">
<td>04;XX</td>
<td>unterstrichen</td>
<td>XX;33</td>
<td>gelb</td>
</tr>
<tr class="odd">
<td>05;XX / 06;XX</td>
<td>blinkend</td>
<td>XX;34</td>
<td>blau</td>
</tr>
<tr class="even">
<td>07;XX</td>
<td>block, invertiert</td>
<td>XX;35</td>
<td>magenta</td>
</tr>
<tr class="odd">
<td>08;XX</td>
<td>Hintergrundfarbe (unsichtbar)</td>
<td>XX;36</td>
<td>cyan</td>
</tr>
<tr class="even">
<td>09;XX</td>
<td>durchgestrichen</td>
<td>XX;37</td>
<td>wei&szlig;</td>
</tr>
</tbody>
</table>
<p>Die oben zitierte “PS1”-Zeile wird demnach wie folgt angezeigt:</p>
<table>
<thead>
<tr class="header">
<th>Schriftcode</th>
<th>Promtteile und ihre Darstellung</th>
</tr>
</thead>
<tbody>
<tr class="odd">
<td>[01;32m]\u@\h</td>
<td>user, @ und host erhalten die Attribute “fett” und “gr&uuml;n”</td>
</tr>
<tr class="even">
<td>[00m]:</td>
<td>Doppelpunkt erh&auml;lt die Standardattribute des Teminals</td>
</tr>
<tr class="odd">
<td>[01;34m]\w</td>
<td>das Arbeitsverzeichnis erh&auml;lt die Attribute “fett” und “blau”</td>
</tr>
<tr class="even">
<td>[00m]\$</td>
<td>der Prompt erh&auml;lt die Standardattribute des Teminals</td>
</tr>
</tbody>
</table>
<p>Soll aus dem Prompt die Farbe entfernt werden, stellen wir der PS1-Zeile eine Raute <code>#</code> und ein <code>Leerzeichen</code> voran. Damit ist die Zeile auskommentiert. Nun gen&uuml;gt es die Zeile</p>
<pre><code>PS1=&#39;${debian_chroot:+($debian_chroot)}\[\033[00m\]\u@\h:\w\$ &#39;</code></pre>
<p>unmittelbar als n&auml;chste Zeile einzuf&uuml;gen.</p>
<p>Soll in dem Prompt die Farbe ge&auml;ndert werden, ist f&uuml;r jeden Teil des Prompts die Farbkodierung anzupassen.</p>
<pre><code> PS1=&#39;${debian_chroot:+($debian_chroot)}\[\033[03;32m\]\u@\h\[\033[01;34m\]:\w\[\033[00m\]\$ &#39;</code></pre>
<p>Dieses Codebeispiel erzeugt einen Promt, in dem <strong>Username @ Hostname</strong> gr&uuml;n und kursiv; der <strong>:</strong> und das <strong>Arbeitsverzeichnis</strong> blau und fett; das <strong>$</strong>-Zeichen und die Befehlseingabe die Kontrastfarbe zum Hintergrund des Terminals erhalten.</p>
<p>Die neuen Farben und Formate erscheinen nach &ouml;ffnen eines neuen Terminals.</p>
<p><strong>Farbeinstellungen des Terminals</strong></p>
<p>Im Men&uuml; des Terminals gibt es unter <em>Bearbeiten</em> - <em>Einstellungen…</em> - Reiter <em>Farben</em> eine Unmenge an Einstellungsm&ouml;glichkeiten. Wir empfehlen eine eher schlichte Einstellung.</p>
<h3 id="wenn-das-terminal-h&auml;ngt">Wenn das Terminal h&auml;ngt</h3>
<p>Manchmal kann ein Terminal nicht mehr so reagieren wie gew&uuml;nscht. Das liegt meist daran, dass sich ein Programm fehlerhaft beendet und das Teminal in einem abnormalen Zustand zur&uuml;ckgelassen hat. Dann muss</p>
<pre><code>reset</code></pre>
<p>eingegeben und die Eingabetaste <strong><code>Enter</code></strong> gedr&uuml;ckt werden.</p>
<p>Wenn die Ausgabe eines Terminals verzerrt erscheint, kann dies meist durch das Dr&uuml;cken von <strong><code>Strg</code></strong>+<strong><code>l</code></strong> behoben werden, dadurch wird das Terminal-Fenster neu aufgebaut. Solche Verzerrungen treten meist auf, wenn man mit Programmen arbeitet, die eine ncurses-Schnittstelle benutzen, zum Beispiel <em>“cgdisk”</em>.</p>
<p>Ein Terminal kann eingefroren erscheinen, was aber in der Regel nicht der Fall ist, sondern die Eingaben werden weiterhin verarbeitet, auch wenn es nicht so scheint. Dies kann durch versehentliches Dr&uuml;cken von <strong><code>Strg</code></strong>+<strong><code>s</code></strong> verursacht sein. In diesem Fall kann <strong><code>Strg</code></strong>+<strong><code>q</code></strong> versucht werden, um die Konsole wieder frei zu geben.</p>
<h3 id="hilfe-im-terminal">Hilfe im Terminal</h3>
<p>Die meisten Befehle/Programme haben eine Kommandozeilenhilfe und auch Anleitungen. Die Anleitungen werden im englischen <em>“man page”</em> oder <em>“manual page”</em>, im deutschen <em>“Manpage”</em> genannt. Die Syntax zum Aufrufen der man page ist:</p>
<pre><code>$ man &lt;Befehl&gt;</code></pre>
<p>oder</p>
<pre><code>$ man -k &lt;keyword&gt;</code></pre>
<p>Dies ruft die Manpage eines Befehls auf. Die Navigation in den Manpages erfolgt durch die Pfeiltasten, beendet werden sie mit <code>q</code> f&uuml;r quit. Beispiel:</p>
<pre><code>$ man apt-get</code></pre>
<p>Um eine Manpage zu verlassen, tippt man <code>q</code></p>
<p>Ein anderes n&uuml;tzliches Werkzeug ist der <code>apropos</code> Befehl. Apropos erm&ouml;glicht es, die Manpages nach einem Befehl zu durchsuchen, wenn man z. B. die Syntax vergessen hat. Beispiel:</p>
<pre><code>$ apropos apt-</code></pre>
<p>Dies listet alle Befehle f&uuml;r den Paketmanager apt auf. Apropos ist ein m&auml;chtiges Werkzeug, f&uuml;r umfangreichere Informationen &uuml;ber apropos siehe</p>
<pre><code>$ man apropos</code></pre>
<h3 id="linux-konsolenbefehle">Linux Konsolenbefehle</h3>
<p>Eine sehr gute Einf&uuml;hrung in die Konsole BASH findet sich auf <a target="_blank" href="http://linuxcommand.org/">linuxcommand.org</a>(englisch).<br />
Nat&uuml;rlich kann auch die favorisierte Suchmaschine verwendet werden, um mehr zu finden.</p>
<p><strong>Brennen von CD, DVD und BD</strong><br />
Die Kommandozeilenprogramme bilden die Basis f&uuml;r beliebte GUI-Programme wie <code>K3b</code>, <code>Brasero</code> oder <code>Xfburn</code>. Wer die vollst&auml;ndige Bandbreite an Optionen der Kommandozeilenprogramme <code>cdrdao</code>, <code>wodim</code>, <code>growisofs</code> usw. bevorzugt, nutzt das Terminal. Unsere Handbuchseite <a target="_blank" href="https://manual.siduction.org/no-gui-burn_de.html#life-dvd-ohne-gui-brennen">DVD ohne GUI brennen</a> enth&auml;lt viele Beispiele und Tips um verf&uuml;gbare Hardware zu erkennen, Daten zusammenzustellen und diese anschlie&szlig;end auf CD, DVD und BD zu brennen.</p>
<h3 id="skripte-benutzen">Skripte benutzen</h3>
<p>Ein Konsolen-Skript ist ein bequemer Weg, um mehrere Befehle in einer Datei zu b&uuml;ndeln. Die Eingabe des Dateinamens des Skripts f&uuml;hrt die Befehle, die im Skript stehen, aus. siduction wird mit einigen sehr n&uuml;tzlichen Skripten ausgeliefert, welche Vereinfachungen der Systemadministration bieten.</p>
<p>Ein Skript wird in der Konsole folgenderma&szlig;en gestartet, wenn man sich im gleichen Verzeichnis befindet:</p>
<pre><code>./name_des_skripts</code></pre>
<p>Einige Skripte ben&ouml;tigen root-Zugang, abh&auml;ngig vom Aufgabenbereich des Skripts.</p>
<p><strong>Installation und Ausf&uuml;hrung</strong></p>
<p>Mit wget kann ein Skript auf den Rechner geladen werden, und man platziert es am besten in das empfohlene Verzeichnis, zum Beispiel nach <code>/usr/local/bin</code>. Zum Kopieren und Einf&uuml;gen in der Konsole kann auch die Maus benutzt werden, nachdem man mit <strong><code>su</code></strong> root-Rechte erlangt hat.</p>
<p><strong>Beispiel mit wget und root-Rechten</strong></p>
<pre><code>$ su
Passwort:
# cd /usr/local/bin
# wget -c ftp://&lt;entfernter_server&gt;/script-name.sh</code></pre>
<p>Danach muss die Datei ausf&uuml;hrbar gemacht werden:</p>
<pre><code># chmod +x script-name.sh</code></pre>
<p>Da das Verzeichnis <code>/usr/local/bin</code> im Suchpfad von root enthalten ist, reicht f&uuml;r root der einfache Befehl</p>
<pre><code># script-name.sh</code></pre>
<p>aus, um das Script zu starten.</p>
<p>Die Datei kann auch mit einem Browser auf den Computer geladen und an den geeigneten Ort verschoben werden, aber sie muss auch dann ausf&uuml;hrbar gemacht werden.</p>
<p><strong>Beispiel mit wget als Nutzer</strong></p>
<p>So speichert man als Nutzer eine Datei im Verzeichnis <code>/home/&lt;user&gt;</code> (der Promt ist ‘$’):</p>
<pre><code>$ wget -c ftp://&lt;entfernter_server&gt;/user-script-name.sh
$ chmod +x user-script-name.sh</code></pre>
<p>Das Skript wird so gestartet:</p>
<pre><code>$ ./user-script-name.sh</code></pre>
<p>Das funktioniert als user nat&uuml;rlich nur, wenn das Script keine Befehle enth&auml;lt, die root-Rechte ben&ouml;tigen.</p>
<div id="rev">
Zuletzt bearbeitet: 2022-03-01
</div>
</body>
</html>
